hananddong/ble_uwb_code/UWB_BLE_nrf52832/components/libraries/cli/nrf_cli.c
/**
    Copyright (c) 2016 - 2018, Nordic Semiconductor ASA

    All rights reserved.

    Redistribution and use in source and binary forms, with or without modification,
    are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
      list of conditions and the following disclaimer.

    2. Redistributions in binary form, except as embedded into a Nordic
      Semiconductor ASA integrated circuit in a product or a software update for
      such product, must reproduce the above copyright notice, this list of
      conditions and the following disclaimer in the documentation and/or other
      materials provided with the distribution.

    3. Neither the name of Nordic Semiconductor ASA nor the names of its
      contributors may be used to endorse or promote products derived from this
      software without specific prior written permission.

    4. This software, with or without modification, must only be used with a
      Nordic Semiconductor ASA integrated circuit.

    5. Any software provided in binary form under this license must not be reverse
      engineered, decompiled, modified and/or disassembled.

    THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
    OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
    OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
    DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
    LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
    CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
    GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
    HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
    LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
    OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.

*/
#include "sdk_common.h"
#if NRF_MODULE_ENABLED(NRF_CLI)
#include <ctype.h>
#include <stdarg.h>
#include <stdlib.h>
#include "nrf_cli.h"
#include "nrf_cli_vt100.h"
#include "app_error.h"
#include "nrf_assert.h"
#include "nrf_delay.h"
#include "nrf_pwr_mgmt.h"
#include "nrf_atomic.h"

#if NRF_MODULE_ENABLED(NRF_CLI_WILDCARD)
    #include "fnmatch.h"
#endif

#if NRF_MODULE_ENABLED(NRF_CLI_HISTORY)
    #if NRF_CLI_HISTORY_ELEMENT_SIZE * NRF_CLI_HISTORY_ELEMENT_COUNT == 0
        #error Not proper memory size allocated for NRF_CLI_HISTORY
    #endif
#endif

/* 2 == 1 char for cmd + 1 char for '\0' */
#if NRF_CLI_CMD_BUFF_SIZE < 2
    #error too small NRF_CLI_CMD_BUFF_SIZE
#endif

#if NRF_CLI_PRINTF_BUFF_SIZE < 1
    #error too small NRF_CLI_PRINTF_BUFF_SIZE
#endif

#define NRF_CLI_HELP_CLEAR              "Clear screen."
#define NRF_CLI_HELP_COLORS             "Toggle colored syntax."
#define NRF_CLI_HELP_COLORS_OFF         "Disable colored syntax."
#define NRF_CLI_HELP_COLORS_ON          "Enable colored syntax."
#define NRF_CLI_HELP_STATISTICS         "CLI statistics."
#define NRF_CLI_HELP_STATISTICS_SHOW    "Get CLI statistics for the Logger module."
#define NRF_CLI_HELP_STATISTICS_RESET   "Reset CLI statistics for the Logger module."
#define NRF_CLI_HELP_RESIZE             "Console gets terminal screen size or assumes 80 in case " \
    "the readout fails. It must be executed after each terminal " \
    "width change to ensure correct text display."
#define NRF_CLI_HELP_RESIZE_DEFAULT     "Assume 80 chars screen width and send this setting "     \
    "to the terminal."
#define NRF_CLI_HELP_HISTORY            "Command history."
#define NRF_CLI_HELP_ECHO               "Toggle CLI echo."
#define NRF_CLI_HELP_ECHO_ON            "Enable CLI echo."
#define NRF_CLI_HELP_ECHO_OFF           "Disable CLI echo. Arrows and buttons: Backspace, "       \
    "Delete, End, Home, Insert are not handled."
#define NRF_CLI_HELP_CLI                "Useful, not Unix-like CLI commands."

#define NRF_CLI_MSG_SPECIFY_SUBCOMMAND  "Please specify a subcommand.\r\n"
#define NRF_CLI_MSG_UNKNOWN_PARAMETER   " unknown parameter: "
#define NRF_CLI_MSG_COMMAND_NOT_FOUND   ": command not found"
#define NRF_CLI_MSG_TAB_OVERFLOWED      "Tab function: commands counter overflowed.\r\n"

/*lint -save -esym(526,cli_command*) -esym(526,cli_sorted_cmd_ptrs*)*/
NRF_SECTION_DEF(cli_command, nrf_cli_cmd_entry_t);
#define CLI_DATA_SECTION_ITEM_GET(i) NRF_SECTION_ITEM_GET(cli_command, nrf_cli_cmd_entry_t, (i))
#define CLI_DATA_SECTION_ITEM_COUNT  NRF_SECTION_ITEM_COUNT(cli_command, nrf_cli_cmd_entry_t)

NRF_SECTION_DEF(cli_sorted_cmd_ptrs, const char *);
/*lint -restore*/
#define CLI_SORTED_CMD_PTRS_ITEM_GET(i) NRF_SECTION_ITEM_GET(cli_sorted_cmd_ptrs, const char *, (i))
#define CLI_SORTED_CMD_PTRS_START_ADDR_GET NRF_SECTION_START_ADDR(cli_sorted_cmd_ptrs)

#if defined(NRF_CLI_LOG_BACKEND) && NRF_CLI_LOG_BACKEND
    #include "nrf_log_str_formatter.h"
    #include "nrf_log_internal.h"
#endif

#define NRF_CLI_INIT_OPTION_PRINTER                  (NULL)

#define NRF_CLI_MAX_TERMINAL_SIZE       (250u)
#define NRF_CLI_CURSOR_POSITION_BUFFER  (10u)   /* 10 == {esc, [, 2, 5, 0, ;, 2, 5, 0, '\0'} */
#define NRF_CLI_DEFAULT_TERMINAL_WIDTH  (80u)   /* Default PuTTY width. */
#define NRF_CLI_DEFAULT_TERMINAL_HEIGHT (24u)   /* Default PuTTY height. */
#define NRF_CLI_INITIAL_CURS_POS        (1u)    /* Initial cursor position is: (1, 1). */

#define NRF_CLI_CMD_ROOT_LVL            (0u)

/* Macro to send VT100 commands. */
#define NRF_CLI_VT100_CMD(_p_cli_, _cmd_)   {       \
        ASSERT(_p_cli_);                                \
        ASSERT(_p_cli_->p_fprintf_ctx);                 \
        static char const cmd[] = _cmd_;                \
        nrf_fprintf(_p_cli_->p_fprintf_ctx, "%s", cmd); \
    }

#if NRF_MODULE_ENABLED(NRF_CLI_WILDCARD)
typedef enum
{
    WILDCARD_CMD_ADDED,
    WILDCARD_CMD_ADDED_MISSING_SPACE,
    WILDCARD_CMD_NO_MATCH_FOUND
} wildcard_cmd_status_t;
#endif


