hananddong/ble_uwb_code/UWB_BLE_nrf52832/components/libraries/cli/nrf_cli.c
static bool cli_log_entry_process(nrf_cli_t const *p_cli, bool skip);
static void cli_execute(nrf_cli_t const *p_cli);


static inline void transport_buffer_flush(nrf_cli_t const *p_cli)
{
    nrf_fprintf_buffer_flush(p_cli->p_fprintf_ctx);
}

static inline void cli_flag_help_set(nrf_cli_t const *p_cli)
{
    p_cli->p_ctx->internal.flag.show_help = 1;
}
static inline void cli_flag_help_clear(nrf_cli_t const *p_cli)
{
    p_cli->p_ctx->internal.flag.show_help = 0;
}

static inline void cli_flag_echo_set(nrf_cli_t const *p_cli)
{
    p_cli->p_ctx->internal.flag.echo = 1;
}

static inline void cli_flag_echo_clear(nrf_cli_t const *p_cli)
{
    p_cli->p_ctx->internal.flag.echo = 0;
}

static inline bool cli_flag_echo_is_set(nrf_cli_t const *p_cli)
{
    return p_cli->p_ctx->internal.flag.echo == 1 ? true : false;
}

static inline bool cli_flag_processing_is_set(nrf_cli_t const *p_cli)
{
    return p_cli->p_ctx->internal.flag.processing == 1 ? true : false;
}

static inline void receive_state_change(nrf_cli_t const *p_cli, nrf_cli_receive_t state)
{
    p_cli->p_ctx->receive_state = state;
}

static inline size_t cli_strlen(char const *str)
{
    return str == NULL ? 0 : strlen(str);
}

static void cli_cmd_buffer_clear(nrf_cli_t const *p_cli)
{
    p_cli->p_ctx->cmd_buff[0] = '\0';  /* clear command buffer */
    p_cli->p_ctx->cmd_buff_pos = 0;
    p_cli->p_ctx->cmd_buff_len = 0;
}

/* Function returns true if cursor is at beginning of an empty line. */
static inline bool cursor_in_empty_line(nrf_cli_t const *p_cli)
{
    return ((p_cli->p_ctx->cmd_buff_pos + cli_strlen(p_cli->p_name)) %
            p_cli->p_ctx->vt100_ctx.cons.terminal_wid == 0);
}

/* Function returns true if command length is equal to multiplicity of terminal width. */
static inline bool full_line_cmd(nrf_cli_t const *p_cli)
{
    return ((p_cli->p_ctx->cmd_buff_len + cli_strlen(p_cli->p_name)) %
            p_cli->p_ctx->vt100_ctx.cons.terminal_wid == 0);
}

#if NRF_MODULE_ENABLED(NRF_CLI_WILDCARD)
/* Function returns true if string contains wildcard character: '?' or '*'. */
static bool wildcard_character_exist(char *p_str)
{
    size_t str_len = cli_strlen(p_str);
    
    for(size_t i = 0; i < str_len; i++)
    {
        if((p_str[i] == '?') || (p_str[i] == '*'))
            return true;
    }
    
    return false;
}
#endif

/*  Function sends data stream to the CLI instance. Each time before the cli_write function is called,
    it must be ensured that IO buffer of fprintf is flushed to avoid synchronization issues.
    For that purpose, use function transport_buffer_flush(p_cli) */
static void cli_write(nrf_cli_t const *p_cli,
                      void const       *p_data,
                      size_t            length,
                      size_t           *p_cnt)
{
    ASSERT(p_cli && p_data);
    ASSERT(p_cli->p_iface->p_api);
    size_t offset = 0;
    size_t cnt;
    
    while(length)
    {
        ret_code_t ret = p_cli->p_iface->p_api->write(p_cli->p_iface,
                                                      &((uint8_t const *)p_data)[offset],
                                                      length,
                                                      &cnt);
        UNUSED_VARIABLE(ret);
        ASSERT(ret == NRF_SUCCESS);
        ASSERT(length >= cnt);
        offset += cnt;
        length -= cnt;
        
        if(cnt == 0 && (p_cli->p_ctx->state != NRF_CLI_STATE_PANIC_MODE_ACTIVE))
        {
            #if NRF_MODULE_ENABLED(NRF_CLI_USES_TASK_MANAGER)
            (void)task_events_wait(NRF_CLI_TRANSPORT_TX_RDY_TASK_EVT);
            #else
            
            while(p_cli->p_ctx->internal.flag.tx_rdy == 0)
                ;
            
            p_cli->p_ctx->internal.flag.tx_rdy = 0;
            #endif
        }
    }
    
    if(p_cnt)
        *p_cnt = cnt;
}

/* Function sends 1 character to the CLI instance. */
static inline void cli_putc(nrf_cli_t const *p_cli, char ch)
{
    nrf_fprintf(p_cli->p_fprintf_ctx, "%c", ch);
}

/* Function reads data from the CLI instance. */
static void cli_read(nrf_cli_t const *p_cli,
                     void             *p_data,
                     size_t            length,
                     size_t           *p_cnt)
{
    ASSERT(p_cli && p_data);
    ASSERT(p_cli->p_iface);
    
    ret_code_t ret = p_cli->p_iface->p_api->read(p_cli->p_iface, p_data, length, p_cnt);
    UNUSED_VARIABLE(ret);
}

/*  Function cmd_get shall be used to search commands. It moves the pointer pp_entry to command
    of static command structure. If the command cannot be found, the function will set pp_entry to NULL.
     p_command   Pointer to command which will be processed (no matter the root command).
     lvl         Level of the requested command.
     idx         Index of the requested command.
     pp_entry    Pointer which points to subcommand[idx] after function execution.
     p_st_entry  Pointer to the structure where dynamic entry data can be stored.
*/
static void cmd_get(nrf_cli_cmd_entry_t const      *p_command,
                    size_t                          lvl,
                    size_t                          idx,
                    nrf_cli_static_entry_t const **pp_entry,
                    nrf_cli_static_entry_t         *p_st_entry)
{
    ASSERT(pp_entry != NULL);
    ASSERT(p_st_entry != NULL);
    
    if(lvl == NRF_CLI_CMD_ROOT_LVL)
    {
        if(idx < CLI_DATA_SECTION_ITEM_COUNT)
        {
            nrf_cli_cmd_entry_t const *p_cmd = NULL;
            char const * * pp_sorted_cmds = (char const * *)CLI_SORTED_CMD_PTRS_START_ADDR_GET;
            
            for(size_t i = 0; i < CLI_DATA_SECTION_ITEM_COUNT; i++)
            {
                p_cmd = CLI_DATA_SECTION_ITEM_GET(i);
                
                if(!strcmp(pp_sorted_cmds[idx], p_cmd->u.p_static->p_syntax))
                {
                    *pp_entry = p_cmd->u.p_static;
                    return;
                }
            }
        }
        
        *pp_entry = NULL;
        return;
    }
    
    if(p_command == NULL)
    {
        *pp_entry = NULL;
        return;
    }
    
    if(p_command->is_dynamic)
    {
        p_command->u.p_dynamic_get(idx, p_st_entry);
        
