hananddong/ble_uwb_code/UWB_BLE_nrf52832/components/libraries/cli/nrf_cli.c
        if(p_st_entry->p_syntax == NULL)
            *pp_entry = NULL;
            
        else
            *pp_entry = p_st_entry;
    }
    
    else
    {
        if(p_command->u.p_static[idx].p_syntax != NULL)
            *pp_entry = &p_command->u.p_static[idx];
            
        else
            *pp_entry = NULL;
    }
}

/*  Function multiline_console_data_check checks the current cursor position (x, y) on terminal screen
    based on: command length, console name length, and terminal width.
    Example 1:
    || - cursor
    ----------------------------
    |console_name $: ||          |
    ----------------------------
    => coordinates are:  cur_x = 17, cur_x_end = 17,
                        cur_y = 1,  cur_y_end = 1
    Example 2:
    ----------------------------
    |console_name $: test command|
    |showing |e|xample           |
    ----------------------------
    => coordinates are:  cur_x = 9, cur_x_end = 18 (cursor can be one column after 'e')
    =>                   cur_y = 2, cur_y_end = 2
    Example 3:
    ----------------------------
    |console_name $: test command|
    |showing e|x|ample with more |
    |parameters                  |
    ----------------------------
    => coordinates are:  cur_x = 10, cur_x_end = 11 (cursor can be one column after 's')
    =>                   cur_y = 2, cur_y_end = 3
*/
static nrf_cli_multiline_cons_t const *multiline_console_data_check(nrf_cli_t const *p_cli)
{
    nrf_cli_ctx_t *p_ctx = p_cli->p_ctx;
    nrf_cli_multiline_cons_t *p_cons = &p_cli->p_ctx->vt100_ctx.cons;
    
    p_cons->name_len = cli_strlen(p_cli->p_name);
    
    /*  Current cursor position in command.
        +1 -> because home position is (1, 1) */
    p_cons->cur_x = (p_ctx->cmd_buff_pos + p_cons->name_len) % p_cons->terminal_wid + 1;
    p_cons->cur_y = (p_ctx->cmd_buff_pos + p_cons->name_len) / p_cons->terminal_wid + 1;
    
    /* Extreme position when cursor is at the end of command. */
    p_cons->cur_y_end = (p_ctx->cmd_buff_len + p_cons->name_len) / p_cons->terminal_wid + 1;
    p_cons->cur_x_end = (p_ctx->cmd_buff_len + p_cons->name_len) % p_cons->terminal_wid + 1;
    
    return p_cons;
}


#if NRF_MODULE_ENABLED(NRF_CLI_METAKEYS)
/* Calculates relative line number of given position in buffer */
static uint32_t cli_line_num_with_buffer_offset_get(nrf_cli_t const *p_cli,
                                                    nrf_cli_cmd_len_t buffer_pos)
{
    uint32_t name_len;
    nrf_cli_multiline_cons_t *p_cons = &p_cli->p_ctx->vt100_ctx.cons;
    
    name_len = cli_strlen(p_cli->p_name);
    
    return ((buffer_pos + name_len) / p_cons->terminal_wid);
}
#endif


#if NRF_MODULE_ENABLED(NRF_CLI_METAKEYS)
/* Calculates column number of given position in buffer */
static uint32_t cli_col_num_with_buffer_offset_get(nrf_cli_t const *p_cli,
                                                   nrf_cli_cmd_len_t buffer_pos)
{
    uint32_t name_len;
    nrf_cli_multiline_cons_t *p_cons = &p_cli->p_ctx->vt100_ctx.cons;
    
    name_len = cli_strlen(p_cli->p_name);
    
    /* columns are counted from 1 */
    return (1 + ((buffer_pos + name_len) % p_cons->terminal_wid));
}
#endif


#if NRF_MODULE_ENABLED(NRF_CLI_METAKEYS)
/* For the given buffer, calculates row span between position2 and position1 */
static int32_t cli_row_span_with_buffer_offsets_get(nrf_cli_t const *p_cli,
                                                    nrf_cli_cmd_len_t offset1,
                                                    nrf_cli_cmd_len_t offset2)
{
    return cli_line_num_with_buffer_offset_get(p_cli, offset2)
           - cli_line_num_with_buffer_offset_get(p_cli, offset1);
}
#endif

#if NRF_MODULE_ENABLED(NRF_CLI_METAKEYS)
/* For the given buffer, calculates column span between position2 and position 1 */
static int32_t cli_column_span_with_buffer_offsets_get(nrf_cli_t const *p_cli,
                                                       nrf_cli_cmd_len_t offset1,
                                                       nrf_cli_cmd_len_t offset2)
{
    return cli_col_num_with_buffer_offset_get(p_cli, offset2)
           - cli_col_num_with_buffer_offset_get(p_cli, offset1);
}
#endif


/* Function sends VT100 command to clear the screen from cursor position to end of the screen. */
static inline void cli_clear_eos(nrf_cli_t const *p_cli)
{
    NRF_CLI_VT100_CMD(p_cli, NRF_CLI_VT100_CLEAREOS);
}

/* Function sends VT100 command to save cursor position. */
static inline void cli_cursor_save(nrf_cli_t const *p_cli)
{
    NRF_CLI_VT100_CMD(p_cli, NRF_CLI_VT100_SAVECURSOR);
}

/* Function sends VT100 command to restore saved cursor position. */
static inline void cli_cursor_restore(nrf_cli_t const *p_cli)
{
    NRF_CLI_VT100_CMD(p_cli, NRF_CLI_VT100_RESTORECURSOR);
}

/* Function forcing new line - cannot be replaced with function cursor_down_move. */
static inline void cursor_next_line_move(nrf_cli_t const *p_cli)
{
    NRF_CLI_VT100_CMD(p_cli, NRF_CLI_VT100_NEXTLINE);
}

/* Function moves cursor left by n positions. */
static inline void cursor_left_move(nrf_cli_t const *p_cli, nrf_cli_cmd_len_t n)
{
    if(n > 0)
        nrf_fprintf(p_cli->p_fprintf_ctx, "\033[%dD", n);
}

/* Function moves cursor right by n positions. */
static inline void cursor_right_move(nrf_cli_t const *p_cli, nrf_cli_cmd_len_t n)
{
    if(n > 0)
        nrf_fprintf(p_cli->p_fprintf_ctx, "\033[%dC", n);
}

#if NRF_MODULE_ENABLED(NRF_CLI_METAKEYS)
/* Moves cursor horizontally by a number. Positive is right */
static void cursor_horiz_move(nrf_cli_t const *p_cli, int32_t delta)
{
    if(delta > 0)
        cursor_right_move(p_cli, delta);
        
    else if(delta < 0)
        cursor_left_move(p_cli, -delta);
        
    else { }
}
#endif

/* Function moves cursor up by n positions. */
static inline void cursor_up_move(nrf_cli_t const *p_cli, nrf_cli_cmd_len_t n)
{
    if(n > 0)
        nrf_fprintf(p_cli->p_fprintf_ctx, "\033[%dA", n);
}

/*  Function moves cursor down by n positions but it will bring no effect if cursor is in the last
    line of terminal screen. In such case, the cursor_next_line_move function shall be invoked. */
static inline void cursor_down_move(nrf_cli_t const *p_cli, nrf_cli_cmd_len_t n)
{
    if(n > 0)
        nrf_fprintf(p_cli->p_fprintf_ctx, "\033[%dB", n);
}

