hananddong/ble_uwb_code/UWB_BLE_nrf52832/components/libraries/cli/nrf_cli.c
#if NRF_MODULE_ENABLED(NRF_CLI_METAKEYS)
/* Moves cursor vertically by a number. Positive is down */
static void cursor_vert_move(nrf_cli_t const *p_cli, int32_t delta)
{
    if(delta > 0)
        cursor_down_move(p_cli, delta);
        
    else if(delta < 0)
        cursor_up_move(p_cli, -delta);
        
    else { }
}
#endif

/* Function increments cursor position (if possible) and moves cursor to new line if necessary. */
static void cursor_position_increment(nrf_cli_t const *p_cli)
{
    if(p_cli->p_ctx->cmd_buff_pos >= p_cli->p_ctx->cmd_buff_len)
    {
        return; /* incrementation not possible */
    }
    
    nrf_cli_multiline_cons_t const *p_cons = multiline_console_data_check(p_cli);
    nrf_cli_cmd_len_t cur_y = p_cons->cur_y;
    ++p_cli->p_ctx->cmd_buff_pos;
    p_cons = multiline_console_data_check(p_cli);
    
    if(cur_y == p_cons->cur_y)
        cursor_right_move(p_cli, 1);
        
    else
        cursor_next_line_move(p_cli);
}

/*  Function will move cursor back to position == cmd_buff_pos. Example usage is when cursor needs
    to be moved back after printing some text. This function cannot be used to move cursor to new
    location by manual change of cmd_buff_pos.*/
static void cursor_position_synchronize(nrf_cli_t const *p_cli)
{
    nrf_cli_multiline_cons_t const *p_cons = multiline_console_data_check(p_cli);
    bool last_line = p_cons->cur_y == p_cons->cur_y_end ? true : false;
    
    /* In case cursor reaches the bottom line of a terminal, it will be moved to the next line. */
    if(cursor_in_empty_line(p_cli) || full_line_cmd(p_cli))
        cursor_next_line_move(p_cli);
        
    if(last_line)
        cursor_left_move(p_cli, p_cons->cur_x_end - p_cons->cur_x);
        
    else
    {
        cursor_up_move(p_cli, p_cons->cur_y_end - p_cons->cur_y);
        
        if(p_cons->cur_x > p_cons->cur_x_end)
            cursor_right_move(p_cli, p_cons->cur_x - p_cons->cur_x_end);
            
        else
            cursor_left_move(p_cli, p_cons->cur_x_end - p_cons->cur_x);
    }
}

#if NRF_MODULE_ENABLED(NRF_CLI_METAKEYS)
/**
    Removes the "word" to the left of the cursor:
    - if there are spaces at the cursor position, remove all spaces to the left
    - remove the non-spaces (word) until a space is found or a beginning of buffer
*/
static void cli_cmd_word_remove(nrf_cli_t const *p_cli)
{
    nrf_cli_cmd_len_t new_pos;
    nrf_cli_cmd_len_t chars_to_delete;
    int32_t row_span;
    int32_t col_span;
    
    /* Line must not be empty and cursor must not be at 0 to continue */
    if((p_cli->p_ctx->cmd_buff_len == 0) || (p_cli->p_ctx->cmd_buff_pos == 0))
        return;
        
    /* start at the current position */
    new_pos = p_cli->p_ctx->cmd_buff_pos;
    chars_to_delete = 0;
    
    /* look back for all spaces then for non-spaces */
    while((new_pos >= 1) && (p_cli->p_ctx->cmd_buff[new_pos - 1] == ' '))
    {
        ++chars_to_delete;
        --new_pos;
    }
    
    while((new_pos >= 1) && (p_cli->p_ctx->cmd_buff[new_pos - 1] != ' '))
    {
        --new_pos;
        ++chars_to_delete;
    }
    
    /* calculate the new cursor */
    row_span = cli_row_span_with_buffer_offsets_get(p_cli, p_cli->p_ctx->cmd_buff_pos, new_pos);
    col_span = cli_column_span_with_buffer_offsets_get(p_cli, p_cli->p_ctx->cmd_buff_pos, new_pos);
    
    /* manage the buffer */
    memmove(&p_cli->p_ctx->cmd_buff[new_pos],
            &p_cli->p_ctx->cmd_buff[new_pos + chars_to_delete],
            p_cli->p_ctx->cmd_buff_len - chars_to_delete);
    p_cli->p_ctx->cmd_buff_len -= chars_to_delete;
    p_cli->p_ctx->cmd_buff_pos = new_pos;
    p_cli->p_ctx->cmd_buff[p_cli->p_ctx->cmd_buff_len] = '\0';
    
    /* update display */
    cursor_horiz_move(p_cli, col_span);
    cursor_vert_move(p_cli, row_span);
    cli_cursor_save(p_cli);
    nrf_cli_fprintf(p_cli,
                    NRF_CLI_NORMAL,
                    "%s",
                    &p_cli->p_ctx->cmd_buff[p_cli->p_ctx->cmd_buff_pos]);
    cli_clear_eos(p_cli);
    cli_cursor_restore(p_cli);
}
#endif

#if NRF_MODULE_ENABLED(NRF_CLI_HISTORY) || NRF_MODULE_ENABLED(NRF_CLI_METAKEYS)
/* Function moves cursor to begin of command position, just after console name. */
static void cursor_home_position_move(nrf_cli_t const *p_cli)
{
    nrf_cli_multiline_cons_t const *p_cons = multiline_console_data_check(p_cli);
    
    if((p_cons->cur_x == p_cons->name_len + NRF_CLI_INITIAL_CURS_POS) &&
       (p_cons->cur_y == NRF_CLI_INITIAL_CURS_POS))
    {
        return; /* nothing to handle because cursor is in start position */
    }
    
    if(p_cons->cur_y > NRF_CLI_INITIAL_CURS_POS)
        cursor_up_move(p_cli, p_cons->cur_y - NRF_CLI_INITIAL_CURS_POS);
        
    if(p_cons->cur_x > p_cons->name_len)
        cursor_left_move(p_cli, p_cons->cur_x - NRF_CLI_INITIAL_CURS_POS - p_cons->name_len);
        
    else
        cursor_right_move(p_cli, p_cons->name_len + NRF_CLI_INITIAL_CURS_POS - p_cons->cur_x);
        
    /* align data buffer pointer with cursor position */
    p_cli->p_ctx->cmd_buff_pos = 0;
}
#endif

/* Function moves cursor to end of command. */
static void cursor_end_position_move(nrf_cli_t const *p_cli)
{
    nrf_cli_multiline_cons_t const *p_cons = multiline_console_data_check(p_cli);
    
    if((p_cons->cur_x == p_cons->cur_x_end) && (p_cons->cur_y == p_cons->cur_y_end))
    {
        return; /* nothing to handle because cursor is in end position */
    }
    
    if(p_cons->cur_y_end > p_cons->cur_y)
        cursor_down_move(p_cli, p_cons->cur_y_end - p_cons->cur_y);
        
    if(p_cons->cur_x > p_cons->cur_x_end)
        cursor_left_move(p_cli, p_cons->cur_x - p_cons->cur_x_end);
        
    else
        cursor_right_move(p_cli, p_cons->cur_x_end - p_cons->cur_x);
        
    /* align data buffer pointer with cursor position */
    p_cli->p_ctx->cmd_buff_pos = p_cli->p_ctx->cmd_buff_len;
}

#if NRF_MODULE_ENABLED(NRF_CLI_BUILD_IN_CMDS)
/* Function reads cursor position from terminal. */
static ret_code_t cursor_position_get(nrf_cli_t const *p_cli)
{
    size_t   cnt;
    uint16_t x = 0; /* horizontal position */
    uint16_t y = 0; /* vertical position */
    char     c = 0;
    
    nrf_cli_cmd_len_t buff_idx = 0;
    
    /* clear temp buffer */
    memset(p_cli->p_ctx->temp_buff, 0, sizeof(p_cli->p_ctx->temp_buff));
    
