hananddong/ble_uwb_code/UWB_BLE_nrf52832/components/libraries/cli/nrf_cli.c
    /* escape code asking terminal about its size */
    static char const cmd_get_terminal_size[] = "\033[6n";
    
    nrf_fprintf(p_cli->p_fprintf_ctx, cmd_get_terminal_size);
    /* fprintf buffer needs to be flushed to start sending prepared escape code to the terminal */
    transport_buffer_flush(p_cli);
    
    /* timeout for terminal response = ~1s */
    for(uint16_t i = 0; i < 1000; i++)
    {
        do
        {
            cli_read(p_cli, &c, sizeof(c), &cnt);
            
            if(cnt == 0)
            {
                nrf_delay_us(999);
                continue;
            }
            
            if((c != NRF_CLI_VT100_ASCII_ESC) &&
               (p_cli->p_ctx->temp_buff[0] != NRF_CLI_VT100_ASCII_ESC))
                continue;
                
            if(c == 'R')  /* end of response from the terminal */
            {
                p_cli->p_ctx->temp_buff[buff_idx] = '\0';
                
                if(p_cli->p_ctx->temp_buff[1] != '[')
                {
                    p_cli->p_ctx->temp_buff[0] = 0;
                    return NRF_ERROR_INVALID_DATA;
                }
                
                buff_idx = 2;  /* index start position in the buffer where 'y' is stored */
                
                while(p_cli->p_ctx->temp_buff[buff_idx] != ';')
                {
                    y = y * 10 + (p_cli->p_ctx->temp_buff[buff_idx++] - '0');
                    
                    if(buff_idx >= NRF_CLI_CMD_BUFF_SIZE)
                        return NRF_ERROR_DATA_SIZE;
                }
                
                if(++buff_idx >= NRF_CLI_CMD_BUFF_SIZE)
                    return NRF_ERROR_DATA_SIZE;
                    
                while(p_cli->p_ctx->temp_buff[buff_idx] != '\0')
                {
                    x = x * 10 + (p_cli->p_ctx->temp_buff[buff_idx++] - '0');
                    
                    if(buff_idx >= NRF_CLI_CMD_BUFF_SIZE)
                        return NRF_ERROR_DATA_SIZE;
                }
                
                /* horizontal cursor position */
                if(x > NRF_CLI_MAX_TERMINAL_SIZE)
                    p_cli->p_ctx->vt100_ctx.cons.cur_x = NRF_CLI_MAX_TERMINAL_SIZE;
                    
                else
                    p_cli->p_ctx->vt100_ctx.cons.cur_x = (nrf_cli_cmd_len_t)x;
                    
                /* vertical cursor position */
                if(y > NRF_CLI_MAX_TERMINAL_SIZE)
                    p_cli->p_ctx->vt100_ctx.cons.cur_y = NRF_CLI_MAX_TERMINAL_SIZE;
                    
                else
                    p_cli->p_ctx->vt100_ctx.cons.cur_y = (nrf_cli_cmd_len_t)y;
                    
                p_cli->p_ctx->temp_buff[0] = 0;
                return NRF_SUCCESS;
            }
            
            else
                p_cli->p_ctx->temp_buff[buff_idx] = c;
                
            if(++buff_idx > NRF_CLI_CURSOR_POSITION_BUFFER - 1)
            {
                p_cli->p_ctx->temp_buff[0] = 0;
                /* data_buf[NRF_CLI_CURSOR_POSITION_BUFFER - 1] is reserved for '\0' */
                return NRF_ERROR_NO_MEM;
            }
            
        } while(cnt > 0);
    }
    
    return NRF_ERROR_TIMEOUT;
}

/* Function gets terminal width and height. */
static ret_code_t terminal_size_get(nrf_cli_t const    *p_cli,
                                    nrf_cli_cmd_len_t *p_length,
                                    nrf_cli_cmd_len_t *p_height)
{
    ASSERT(p_length);
    ASSERT(p_height);
    
    uint16_t x;
    uint16_t y;
    
    if(cursor_position_get(p_cli) == NRF_SUCCESS)
    {
        x = p_cli->p_ctx->vt100_ctx.cons.cur_x;
        y = p_cli->p_ctx->vt100_ctx.cons.cur_y;
        /* assumption: terminal widht and height < 999 */
        cursor_right_move(p_cli, NRF_CLI_MAX_TERMINAL_SIZE); /* move to last column */
        cursor_down_move(p_cli,  NRF_CLI_MAX_TERMINAL_SIZE); /* move to last row */
    }
    
    else
        return NRF_ERROR_NOT_SUPPORTED;
        
    if(cursor_position_get(p_cli) == NRF_SUCCESS)
    {
        *p_length = p_cli->p_ctx->vt100_ctx.cons.cur_x;
        *p_height = p_cli->p_ctx->vt100_ctx.cons.cur_y;
        cursor_left_move(p_cli, *p_length - x);
        cursor_up_move(p_cli, *p_height - y);
        
        return NRF_SUCCESS;
    }
    
    return NRF_ERROR_NOT_SUPPORTED;
}
#endif // NRF_MODULE_ENABLED(NRF_CLI_BUILD_IN_CMDS)

#if NRF_MODULE_ENABLED(NRF_CLI_VT100_COLORS)
static void vt100_color_set(nrf_cli_t const *p_cli, nrf_cli_vt100_color_t color)
{
    if(color != NRF_CLI_DEFAULT)
    {
        if(p_cli->p_ctx->vt100_ctx.col.col == color)
            return;
            
        uint8_t cmd[] = NRF_CLI_VT100_COLOR(color - 1);
        
        p_cli->p_ctx->vt100_ctx.col.col = color;
        nrf_fprintf(p_cli->p_fprintf_ctx, "%s", cmd);
    }
    
    else
    {
        static uint8_t const cmd[] = NRF_CLI_VT100_MODESOFF;
        
        p_cli->p_ctx->vt100_ctx.col.col = color;
        nrf_fprintf(p_cli->p_fprintf_ctx, "%s", cmd);
    }
}

static void vt100_bgcolor_set(nrf_cli_t const *p_cli, nrf_cli_vt100_color_t bgcolor)
{
    if(bgcolor != NRF_CLI_DEFAULT)
    {
        if(p_cli->p_ctx->vt100_ctx.col.bgcol == bgcolor)
            return;
            
        /* -1 because default value is first in enum */
        uint8_t cmd[] = NRF_CLI_VT100_BGCOLOR(bgcolor - 1);
        
        p_cli->p_ctx->vt100_ctx.col.bgcol = bgcolor;
        nrf_fprintf(p_cli->p_fprintf_ctx, "%s", cmd);
    }
}

static inline void vt100_colors_store(nrf_cli_t const         *p_cli,
                                      nrf_cli_vt100_colors_t *p_color)
{
    memcpy(p_color, &p_cli->p_ctx->vt100_ctx.col, sizeof(nrf_cli_vt100_colors_t));
}

static void vt100_colors_restore(nrf_cli_t const               *p_cli,
                                 nrf_cli_vt100_colors_t const *p_color)
{
    vt100_color_set(p_cli, p_color->col);
    vt100_bgcolor_set(p_cli, p_color->bgcol);
}
#endif // NRF_MODULE_ENABLED(NRF_CLI_VT100_COLORS)

static void left_arrow_handle(nrf_cli_t const *p_cli)
{
    nrf_cli_multiline_cons_t const *p_cons = multiline_console_data_check(p_cli);
    
