hananddong/ble_uwb_code/UWB_BLE_nrf52832/components/libraries/cli/nrf_cli.c
    nrf_cli_multiline_cons_t const *p_cons = multiline_console_data_check(p_cli);
    bool last_line = p_cons->cur_y == p_cons->cur_y_end ? true : false;
    
    /* If last line of command is edited, there is no need for saving cursor position. */
    if(last_line)
    {
        nrf_cli_fprintf(p_cli,
                        NRF_CLI_NORMAL,
                        "%s",
                        &p_cli->p_ctx->cmd_buff[p_cli->p_ctx->cmd_buff_pos]);
        NRF_CLI_VT100_CMD(p_cli, NRF_CLI_VT100_CLEAREOL);
        cursor_left_move(p_cli, --diff);
    }
    
    else
    {
        cli_cursor_save(p_cli);
        cli_clear_eos(p_cli);
        nrf_cli_fprintf(p_cli,
                        NRF_CLI_NORMAL,
                        "%s",
                        &p_cli->p_ctx->cmd_buff[p_cli->p_ctx->cmd_buff_pos]);
        cli_cursor_restore(p_cli);
    }
}

static char make_argv(size_t *p_argc, char **pp_argv, char *p_cmd, uint8_t max_argc)
{
    char c;
    char quote = 0;
    
    *p_argc = 0;
    
    do
    {
        c = *p_cmd;
        
        if(c == '\0')
            break;
            
        if(isspace((int)c))
        {
            *p_cmd++ = '\0';
            continue;
        }
        
        pp_argv[(*p_argc)++] = p_cmd;
        quote = 0;
        
        while(1)
        {
            c = *p_cmd;
            
            if(c == '\0')
                break;
                
            if(!quote)
            {
                switch(c)
                {
                    case '\\':
                        memmove(p_cmd, p_cmd + 1, cli_strlen(p_cmd));
                        p_cmd += 1;
                        continue;
                        
                    case '\'':
                    case '\"':
                        memmove(p_cmd, p_cmd + 1, cli_strlen(p_cmd));
                        quote = c;
                        continue;
                        
                    default:
                        break;
                }
            }
            
            if(quote == c)
            {
                memmove(p_cmd, p_cmd + 1, cli_strlen(p_cmd));
                quote = 0;
                continue;
            }
            
            if(quote && c == '\\')
            {
                char t = *(p_cmd + 1);
                
                if(t == quote)
                {
                    memmove(p_cmd, p_cmd + 1, cli_strlen(p_cmd));
                    p_cmd += 1;
                    continue;
                }
                
                if(t == '0')
                {
                    uint8_t i;
                    uint8_t v = 0;
                    
                    for(i = 2; i < (2 + 3); i++)
                    {
                        t = *(p_cmd + i);
                        
                        if(t >= '0' && t <= '7')
                            v = (v << 3) | (t - '0');
                            
                        else
                            break;
                    }
                    
                    if(i > 2)
                    {
                        memmove(p_cmd, p_cmd + (i - 1), cli_strlen(p_cmd) - (i - 2));
                        *p_cmd++ = v;
                        continue;
                    }
                }
                
                if(t == 'x')
                {
                    uint8_t i;
                    uint8_t v = 0;
                    
                    for(i = 2; i < (2 + 2); i++)
                    {
                        t = *(p_cmd + i);
                        
                        if(t >= '0' && t <= '9')
                            v = (v << 4) | (t - '0');
                            
                        else if(t >= 'a' && t <= 'f')
                            v = (v << 4) | (t - 'a' + 10);
                            
                        else if(t >= 'A' && t <= 'F')
                            v = (v << 4) | (t - 'A' + 10);
                            
                        else
                            break;
                    }
                    
                    if(i > 2)
                    {
                        memmove(p_cmd, p_cmd + (i - 1), cli_strlen(p_cmd) - (i - 2));
                        *p_cmd++ = v;
                        continue;
                    }
                }
            }
            
            if(!quote && isspace((int)c))
                break;
                
            p_cmd += 1;
        }
    } while(*p_argc < max_argc);
    
    ASSERT(*p_argc <= NRF_CLI_ARGC_MAX);
    pp_argv[*p_argc] = 0;
    
    return quote;
}

static void cli_state_set(nrf_cli_t const *p_cli, nrf_cli_state_t state)
{
    p_cli->p_ctx->state = state;
    
    if(state == NRF_CLI_STATE_ACTIVE)
    {
        cli_cmd_buffer_clear(p_cli);
        nrf_cli_fprintf(p_cli, NRF_CLI_INFO, "%s", p_cli->p_name);
    }
}

#if NRF_MODULE_ENABLED(NRF_CLI_HISTORY)
static inline void history_mode_exit(nrf_cli_t const *p_cli)
{
    p_cli->p_ctx->p_cmd_list_element = NULL;
}

static void history_handle(nrf_cli_t const *p_cli, bool up)
{
    nrf_cli_memobj_header_t header =
    {
        .p_prev = NULL,
        .p_next = NULL,
        .cmd_len = 0
    };
    nrf_cli_cmd_len_t current_cmd_len;
    bool skip = false;
    
    if(!up)  /* button down */
    {
        if(p_cli->p_ctx->p_cmd_list_element == NULL)
            return;
            
        cursor_home_position_move(p_cli);
        
        nrf_memobj_read(p_cli->p_ctx->p_cmd_list_element,
                        &header,
                        NRF_CLI_HISTORY_HEADER_SIZE,
                        0);
                        
        p_cli->p_ctx->p_cmd_list_element = header.p_next;
        current_cmd_len = p_cli->p_ctx->cmd_buff_len;
        
        if(p_cli->p_ctx->p_cmd_list_element == NULL)
        {
            if(cli_strlen(p_cli->p_ctx->temp_buff) > 0)
                strcpy(p_cli->p_ctx->cmd_buff, p_cli->p_ctx->temp_buff);
                
            else
                p_cli->p_ctx->cmd_buff[0] = '\0';
                
            header.cmd_len = cli_strlen(p_cli->p_ctx->cmd_buff);
            skip = true;
        }
    }
    
    else /* button up */
    {
        if((p_cli->p_ctx->p_cmd_list_element == p_cli->p_ctx->p_cmd_list_tail) ||
           (p_cli->p_ctx->p_cmd_list_head == NULL))
        {
            /* Nothing to display. */
            return;
        }
        
        cursor_home_position_move(p_cli);
        
        if(p_cli->p_ctx->p_cmd_list_element == NULL)
        {
            current_cmd_len = cli_strlen(p_cli->p_ctx->cmd_buff);
            
            p_cli->p_ctx->p_cmd_list_element = p_cli->p_ctx->p_cmd_list_head;
            
