hananddong/ble_uwb_code/UWB_BLE_nrf52832/components/libraries/cli/nrf_cli.c
            /* Save the currently entered and not executed command. */
            if(current_cmd_len > 0)
                strcpy(p_cli->p_ctx->temp_buff, p_cli->p_ctx->cmd_buff);
                
            else
                p_cli->p_ctx->temp_buff[0] = '\0';
        }
        
        else
        {
            nrf_memobj_read(p_cli->p_ctx->p_cmd_list_element,
                            &header,
                            NRF_CLI_HISTORY_HEADER_SIZE,
                            0);
            current_cmd_len = header.cmd_len;
            p_cli->p_ctx->p_cmd_list_element = header.p_prev;
        }
    }
    
    if(!skip)
    {
        nrf_memobj_read(p_cli->p_ctx->p_cmd_list_element,
                        &header,
                        NRF_CLI_HISTORY_HEADER_SIZE,
                        0);
                        
        nrf_memobj_read(p_cli->p_ctx->p_cmd_list_element,
                        p_cli->p_ctx->cmd_buff,
                        header.cmd_len + 1, /* +1 for '\0' */
                        NRF_CLI_HISTORY_HEADER_SIZE);
    }
    
    p_cli->p_ctx->cmd_buff_pos = header.cmd_len;
    p_cli->p_ctx->cmd_buff_len = header.cmd_len;
    
    if(current_cmd_len > header.cmd_len)
        cli_clear_eos(p_cli);
        
    nrf_cli_fprintf(p_cli, NRF_CLI_NORMAL, "%s", p_cli->p_ctx->cmd_buff);
    
    if(cursor_in_empty_line(p_cli) || full_line_cmd(p_cli))
        cursor_next_line_move(p_cli);
}

static void history_list_element_add(nrf_cli_t const *p_cli, nrf_memobj_t *p_memobj)
{
    ASSERT(p_memobj != NULL);
    
    nrf_cli_memobj_header_t header;
    
    if(p_cli->p_ctx->p_cmd_list_head == NULL)
    {
        p_cli->p_ctx->p_cmd_list_head = p_memobj;
        p_cli->p_ctx->p_cmd_list_tail = p_memobj;
        header.p_prev = NULL;
        header.p_next = NULL;
        header.cmd_len = p_cli->p_ctx->cmd_buff_len;
    }
    
    else
    {
        nrf_memobj_read(p_cli->p_ctx->p_cmd_list_head,
                        &header,
                        NRF_CLI_HISTORY_HEADER_SIZE,
                        0);
                        
        header.p_next = p_memobj;
        
        nrf_memobj_write(p_cli->p_ctx->p_cmd_list_head,
                         &header,
                         NRF_CLI_HISTORY_HEADER_SIZE,
                         0);
                         
        header.p_next = NULL;
        header.p_prev = p_cli->p_ctx->p_cmd_list_head;
        header.cmd_len = p_cli->p_ctx->cmd_buff_len;
        
        p_cli->p_ctx->p_cmd_list_head = p_memobj;
    }
    
    nrf_memobj_write(p_memobj,
                     &header,
                     NRF_CLI_HISTORY_HEADER_SIZE,
                     0);
                     
    nrf_memobj_write(p_memobj,
                     p_cli->p_ctx->cmd_buff,
                     p_cli->p_ctx->cmd_buff_len + 1, /* +1 for '\0' */
                     NRF_CLI_HISTORY_HEADER_SIZE);
}

static void history_list_element_oldest_remove(nrf_cli_t const *p_cli)
{
    if(p_cli->p_ctx->p_cmd_list_tail == NULL)
    {
        return; // nothing to do
    }
    
    nrf_cli_memobj_header_t header;
    nrf_memobj_t *p_memobj = p_cli->p_ctx->p_cmd_list_tail;
    
    nrf_memobj_read(p_memobj,
                    &header,
                    NRF_CLI_HISTORY_HEADER_SIZE,
                    0);
                    
    p_cli->p_ctx->p_cmd_list_tail = header.p_next;
    memset(&header, 0, sizeof(nrf_cli_memobj_header_t));
    nrf_memobj_write(p_memobj, &header, NRF_CLI_HISTORY_HEADER_SIZE, 0);
    nrf_memobj_free(p_memobj);
    
    /* Checking if memory objects list is empty. */
    if(p_cli->p_ctx->p_cmd_list_tail == NULL)
    {
        p_cli->p_ctx->p_cmd_list_head = NULL;
        return;
    }
    
    nrf_memobj_read(p_cli->p_ctx->p_cmd_list_tail,
                    &header,
                    NRF_CLI_HISTORY_HEADER_SIZE,
                    0);
                    
    header.p_prev = NULL;
    nrf_memobj_write(p_cli->p_ctx->p_cmd_list_tail, &header, NRF_CLI_HISTORY_HEADER_SIZE, 0);
}

static void history_list_free_memory(nrf_cli_t const *p_cli)
{
    while(p_cli->p_ctx->p_cmd_list_tail != NULL)
        history_list_element_oldest_remove(p_cli);
}

static void history_save(nrf_cli_t const *p_cli)
{
    nrf_cli_cmd_len_t cmd_new_len = cli_strlen(p_cli->p_ctx->cmd_buff);
    
    history_mode_exit(p_cli);
    
    if(cmd_new_len == 0)
        return;
        
    /* Checking if newly entered command is not duplicated with previous one. */
    if(p_cli->p_ctx->p_cmd_list_head != NULL)
    {
        nrf_cli_memobj_header_t header;
        
        nrf_memobj_read(p_cli->p_ctx->p_cmd_list_head,
                        &header,
                        NRF_CLI_HISTORY_HEADER_SIZE,
                        0);
                        
        if(cmd_new_len == header.cmd_len)
        {
            nrf_memobj_read(p_cli->p_ctx->p_cmd_list_head,
                            p_cli->p_ctx->temp_buff,
                            header.cmd_len + 1, /* +1 for '\0' */
                            NRF_CLI_HISTORY_HEADER_SIZE);
                            
            if(strcmp(p_cli->p_ctx->cmd_buff, p_cli->p_ctx->temp_buff) == 0)
            {
                /* Duplicated command, nothing to save. */
                p_cli->p_ctx->temp_buff[0] = '\0';
                return;
            }
            
            p_cli->p_ctx->temp_buff[0] = '\0';
        }
    }
    
    for(size_t idx = 0; idx < NRF_CLI_HISTORY_ELEMENT_COUNT; idx++)
    {
        nrf_memobj_t *p_memobj;
        
        p_memobj = nrf_memobj_alloc(p_cli->p_cmd_hist_mempool,
                                    ((size_t)NRF_CLI_HISTORY_HEADER_SIZE + cmd_new_len + 1));
                                    
        if(p_memobj != NULL)
        {
            history_list_element_add(p_cli, p_memobj);
            return;
        }
        
        else
            history_list_element_oldest_remove(p_cli);
    }
    
    return;
}
#endif // NRF_MODULE_ENABLED(NRF_CLI_HISTORY)

/* Function checks how many identical characters have two strings starting from the first character. */
static nrf_cli_cmd_len_t str_similarity_check(char const *str_a, char const *str_b)
{
    nrf_cli_cmd_len_t cnt = 0;
    
    while(str_a[cnt] != '\0')
    {
        if(str_a[cnt] != str_b[cnt])
            return cnt;
            
        if(++cnt == 0)
        {
            return --cnt; /* too long strings */
        }
    }
    
    return cnt;
}

static void completion_insert(nrf_cli_t const *p_cli,
                              char const       *p_compl,
                              nrf_cli_cmd_len_t compl_len)
{
    ASSERT(p_compl);
    
    nrf_cli_cmd_len_t diff = p_cli->p_ctx->cmd_buff_len - p_cli->p_ctx->cmd_buff_pos;
    
    if((p_cli->p_ctx->cmd_buff_len + compl_len > NRF_CLI_CMD_BUFF_SIZE - 1) ||
       (compl_len == 0))
        return;
        
    /* Make space for completion. */
    memmove(&p_cli->p_ctx->cmd_buff[p_cli->p_ctx->cmd_buff_pos + compl_len],
            &p_cli->p_ctx->cmd_buff[p_cli->p_ctx->cmd_buff_pos],
            diff + 1); /* + 1 for '\0' */
            
    /* Insert completion. */
    memmove(&p_cli->p_ctx->cmd_buff[p_cli->p_ctx->cmd_buff_pos],
            p_compl,
            compl_len);
            
    p_cli->p_ctx->cmd_buff_len = cli_strlen(p_cli->p_ctx->cmd_buff);
    nrf_cli_fprintf(p_cli,
                    NRF_CLI_NORMAL,
                    "%s",
                    &p_cli->p_ctx->cmd_buff[p_cli->p_ctx->cmd_buff_pos]);
    p_cli->p_ctx->cmd_buff_pos += compl_len;
    
    if(cursor_in_empty_line(p_cli) || full_line_cmd(p_cli))
        cursor_next_line_move(p_cli);
        
