hananddong/ble_uwb_code/UWB_BLE_nrf52832/components/libraries/cli/nrf_cli.c
    if(diff > 0)
        cursor_position_synchronize(p_cli);
}

static void option_print(nrf_cli_t const *p_cli,
                         char const       *p_option,
                         nrf_cli_cmd_len_t longest_option)
{
    static char const *tab = "  ";
    
    /* Function initialization has been requested. */
    if(p_option == NULL)
    {
        p_cli->p_ctx->vt100_ctx.printed_cmd = 0;
        return;
    }
    
    longest_option += cli_strlen(tab);
    
    nrf_cli_cmd_len_t columns =
        (p_cli->p_ctx->vt100_ctx.cons.terminal_wid - cli_strlen(tab)) / longest_option;
    nrf_cli_cmd_len_t diff = longest_option - cli_strlen(p_option);
    
    if(p_cli->p_ctx->vt100_ctx.printed_cmd++ % columns == 0)
        nrf_cli_fprintf(p_cli, NRF_CLI_OPTION, "\r\n%s%s", tab, p_option);
        
    else
        nrf_cli_fprintf(p_cli, NRF_CLI_OPTION, "%s", p_option);
        
    cursor_right_move(p_cli, diff);
}

static void cli_tab_handle(nrf_cli_t const *p_cli)
{
    size_t cmd_idx;
    size_t cmd_last = 0;
    size_t cmd_first = 0;
    
    size_t argc;
    char *argv[NRF_CLI_ARGC_MAX + 1];  /* +1 reserved for NULL in function make_argv */
    
    nrf_cli_cmd_len_t cmd_lvl = NRF_CLI_CMD_ROOT_LVL;
    nrf_cli_cmd_len_t cmd_longest = 0; /* longest matching command */
    
    /* Calculating the longest possible completion length. -1 for '\0'. */
    nrf_cli_cmd_len_t compl_len = (NRF_CLI_CMD_BUFF_SIZE - 1) - p_cli->p_ctx->cmd_buff_len;
    
    if(compl_len == 0)
        return;
        
    /* Copy command from its beginning to cursor position. */
    memcpy(p_cli->p_ctx->temp_buff,
           p_cli->p_ctx->cmd_buff,
           p_cli->p_ctx->cmd_buff_pos);
           
    p_cli->p_ctx->temp_buff[p_cli->p_ctx->cmd_buff_pos] = '\0';
    
    /* Check if the current cursor position points to the 'space' character. */
    bool space = isspace((int)p_cli->p_ctx->cmd_buff[p_cli->p_ctx->cmd_buff_pos - 1]);
    
    #if NRF_MODULE_ENABLED(NRF_CLI_HISTORY)
    /*  If the Tab key is pressed, "history mode" must be terminated because tab and history handlers
        are sharing the same array: temp_buff. */
    history_mode_exit(p_cli);
    #endif
    
    /* Create argument list. */
    (void)make_argv(&argc,
                    &argv[0],
                    p_cli->p_ctx->temp_buff,
                    NRF_CLI_ARGC_MAX);
                    
    nrf_cli_cmd_len_t arg_len = cli_strlen(argv[cmd_lvl]);
    
    /* Variable 'static_entry' is needed to handle dynamic commands. */
    nrf_cli_static_entry_t static_entry;
    
    nrf_cli_cmd_entry_t const *p_cmd = NULL;
    nrf_cli_static_entry_t const *p_st_cmd = NULL;
    nrf_cli_static_entry_t const *p_st_cmd_last = NULL;
    
    do
    {
        if((argc == 0) ||
           (cmd_lvl >= argc - 1 + space))
        {
            if(space)
                arg_len = 0;
                
            else
                arg_len = cli_strlen(argv[cmd_lvl]);
                
            cmd_idx = 0;
            
            while(1)
            {
                cmd_get(p_cmd, cmd_lvl, cmd_idx++, &p_st_cmd, &static_entry);
                
                if(p_st_cmd == NULL)
                {
                    /* No more commands available. */
                    break;
                }
                
                if(strncmp(argv[cmd_lvl], p_st_cmd->p_syntax, arg_len) != 0)
                {
                    if(p_st_cmd_last != NULL)
                    {
                        /* No more matches will be found as commands are sorted alphabetically. */
                        break;
                    }
                    
                    continue;
                }
                
                if(p_st_cmd_last == NULL)
                {
                    cmd_first = cmd_idx - 1;
                    cmd_longest = cli_strlen(p_st_cmd->p_syntax);
                    
                    if(compl_len > (cmd_longest - arg_len))
                        compl_len = cmd_longest - arg_len;
                }
                
                else
                {
                    nrf_cli_cmd_len_t len = cli_strlen(p_st_cmd->p_syntax);
                    
                    if(len > cmd_longest)
                        cmd_longest = len;
                        
                    if(compl_len > 0)   /* Checking if partial completion is possible */
                    {
                        nrf_cli_static_entry_t last_entry;
                        cmd_get(p_cmd, cmd_lvl, cmd_last, &p_st_cmd_last, &last_entry);
                        
                        len = str_similarity_check(p_st_cmd->p_syntax + arg_len,
                                                   p_st_cmd_last->p_syntax + arg_len);
                                                   
                        if(compl_len > len)
                        {
                            /* Determining the longest possible completion. */
                            compl_len = len;
                        }
                    }
                }
                
                cmd_last = cmd_idx - 1;
                p_st_cmd_last = p_st_cmd;
                
                if(cmd_idx == 0)  /* Too many possibilities */
                {
                    nrf_cli_fprintf(p_cli, NRF_CLI_WARNING, NRF_CLI_MSG_TAB_OVERFLOWED);
                    break;
                }
            }
        }
        
        else
        {
            cmd_idx = 0;
            
            while(1)
            {
                cmd_get(p_cmd, cmd_lvl, cmd_idx++, &p_st_cmd, &static_entry);
                
                if(cmd_idx == 0)
                {
                    /* No match found and commands counter overflowed. */
                    nrf_cli_fprintf(p_cli, NRF_CLI_WARNING, NRF_CLI_MSG_TAB_OVERFLOWED);
                    return;
                }
                
                if(p_st_cmd == NULL)  /* No more commands available */
                    return;
                    
                #if NRF_MODULE_ENABLED(NRF_CLI_WILDCARD)
                    
                /*  Ignore wildcard character arguments if they are "standalone". Example:
                    1. log enable info b*<tab>  -> "b*"  is treated as a command so no match found
                    2. log enable info b* <tab> -> "b* " is ignored, <tab> will prompt all available
                                                   commands. */
                if(wildcard_character_exist(argv[cmd_lvl]))
                    break;
                    
                #endif
                    
                /* Fuction "strcmp" is used because an exact match is required. */
                if(strcmp(argv[cmd_lvl], p_st_cmd->p_syntax) == 0)
                {
                    p_cmd = p_st_cmd->p_subcmd;
                    break;
                }
            }
        }
        
        if((p_cmd == NULL) || (p_st_cmd == NULL))
            break;
            
    } while(++cmd_lvl < argc + space);
    
    if(p_st_cmd_last == NULL)
    {
        /* No match found. */
        return;
    }
    
    if(cmd_first == cmd_last)  /* only one match found */
    {
        if(p_cmd->is_dynamic)
        {
            /*  In case of dynamic entry, function cmd_get shall be called again for matching
                command index (cmd_last). It is because static_entry is most likely appended by
                not valid data.
            */
            cmd_get(p_cmd, cmd_lvl, cmd_last, &p_st_cmd_last, &static_entry);
        }
        
