hananddong/ble_uwb_code/UWB_BLE_nrf52832/components/libraries/cli/nrf_cli.c
        if(cli_strlen(p_st_cmd_last->p_syntax) != arg_len)  /* no exact match found */
            completion_insert(p_cli, p_st_cmd_last->p_syntax + arg_len, compl_len);
            
        /* Next character in the buffer is not 'space'. */
        if(!isspace((int)p_cli->p_ctx->cmd_buff[p_cli->p_ctx->cmd_buff_pos]))
        {
            if(p_cli->p_ctx->internal.flag.insert_mode)
            {
                p_cli->p_ctx->internal.flag.insert_mode = 0;
                char_insert(p_cli, ' ');
                p_cli->p_ctx->internal.flag.insert_mode = 1;
            }
            
            else
                char_insert(p_cli, ' ');
        }
        
        else
        {
            /*  case:
                | | -> cursor
                cons_name $: valid_cmd valid_sub_cmd| |argument  <tab>
            */
            cursor_position_increment(p_cli);
            /*  result:
                cons_name $: valid_cmd valid_sub_cmd |a|rgument
            */
        }
        
        return;
    }
    
    /* Printing all matching commands (options). */
    option_print(p_cli, NRF_CLI_INIT_OPTION_PRINTER, cmd_longest);
    
    for(cmd_idx = cmd_first; cmd_idx <= cmd_last; cmd_idx++)
    {
        cmd_get(p_cmd, cmd_lvl, cmd_idx, &p_st_cmd, &static_entry);
        option_print(p_cli, p_st_cmd->p_syntax, cmd_longest);
    }
    
    nrf_cli_fprintf(p_cli, NRF_CLI_INFO, "\r\n%s", p_cli->p_name);
    nrf_cli_fprintf(p_cli, NRF_CLI_NORMAL, "%s", p_cli->p_ctx->cmd_buff);
    
    cursor_position_synchronize(p_cli);
    completion_insert(p_cli, p_st_cmd_last->p_syntax + arg_len, compl_len);
}

#define NRF_CLI_ASCII_MAX_CHAR (127u)
static inline ret_code_t ascii_filter(char const data)
{
    return (uint8_t)data > NRF_CLI_ASCII_MAX_CHAR ? NRF_ERROR_INVALID_DATA : NRF_SUCCESS;
}

static void cli_state_collect(nrf_cli_t const *p_cli)
{
    size_t count = 0;
    char data;
    
    while(1)
    {
        cli_read(p_cli, &data, sizeof(data), &count);
        
        if(count == 0)
            return;
            
        if(ascii_filter(data) != NRF_SUCCESS)
            continue;
            
        #if NRF_MODULE_ENABLED(NRF_PWR_MGMT)
        nrf_pwr_mgmt_feed();
        #endif
        
        switch(p_cli->p_ctx->receive_state)
        {
            case NRF_CLI_RECEIVE_DEFAULT:
                if(data == p_cli->newline_char)
                {
                    if(p_cli->p_ctx->cmd_buff_len == 0)
                    {
                        history_mode_exit(p_cli);
                        cursor_next_line_move(p_cli);
                    }
                    
                    else
                    {
                        /* Command execution */
                        cli_execute(p_cli);
                    }
                    
                    cli_state_set(p_cli, NRF_CLI_STATE_ACTIVE);
                    return;
                }
                
                switch(data)
                {
                    case NRF_CLI_VT100_ASCII_ESC:       /* ESCAPE */
                        receive_state_change(p_cli, NRF_CLI_RECEIVE_ESC);
                        break;
                        
                    case '\0':
                        break;
                        #if NRF_MODULE_ENABLED(NRF_CLI_METAKEYS)
                        
                    case NRF_CLI_VT100_ASCII_CTRL_A:    /* CTRL + A */
                        cursor_home_position_move(p_cli);
                        break;
                        
                    case NRF_CLI_VT100_ASCII_CTRL_C:    /* CTRL + C */
                        cursor_end_position_move(p_cli);
                        
                        if(!cursor_in_empty_line(p_cli))
                            cursor_next_line_move(p_cli);
                            
                        cli_state_set(p_cli, NRF_CLI_STATE_ACTIVE);
                        break;
                        
                    case NRF_CLI_VT100_ASCII_CTRL_E:    /* CTRL + E */
                        cursor_end_position_move(p_cli);
                        break;
                        
                    case NRF_CLI_VT100_ASCII_CTRL_L:    /* CTRL + L */
                        NRF_CLI_VT100_CMD(p_cli, NRF_CLI_VT100_CURSORHOME);
                        NRF_CLI_VT100_CMD(p_cli, NRF_CLI_VT100_CLEARSCREEN);
                        nrf_cli_fprintf(p_cli, NRF_CLI_INFO, "%s", p_cli->p_name);
                        
                        if(cli_flag_echo_is_set(p_cli))
                        {
                            nrf_cli_fprintf(p_cli, NRF_CLI_NORMAL, "%s", p_cli->p_ctx->cmd_buff);
                            cursor_position_synchronize(p_cli);
                        }
                        
                        break;
                        
                    case NRF_CLI_VT100_ASCII_CTRL_U:    /* CTRL + U */
                        cursor_home_position_move(p_cli);
                        cli_cmd_buffer_clear(p_cli);
                        cli_clear_eos(p_cli);
                        break;
                        
                    case NRF_CLI_VT100_ASCII_CTRL_W:    /* CTRL + W */
                        cli_cmd_word_remove(p_cli);
                        break;
                        #endif
                        
                    case '\t':                          /* TAB */
                        if(cli_flag_echo_is_set(p_cli))
                            cli_tab_handle(p_cli);
                            
                        break;
                        
                    case NRF_CLI_VT100_ASCII_BSPACE:    /* BACKSPACE */
                        if(cli_flag_echo_is_set(p_cli))
                            char_backspace(p_cli);
                            
                        break;
                        
                    case NRF_CLI_VT100_ASCII_DEL:       /* DELETE */
                        if(cli_flag_echo_is_set(p_cli))
                            char_delete(p_cli);
                            
                        break;
                        
                    default:
                        if(isprint((int)data))
                        {
                            if(cli_flag_echo_is_set(p_cli))
                                char_insert(p_cli, data);
                                
                            else
                                char_insert_echo_off(p_cli, data);
                        }
                        
                        break;
                }
                
                break;
                
            case NRF_CLI_RECEIVE_ESC:
                if(data == '[')
                    receive_state_change(p_cli, NRF_CLI_RECEIVE_ESC_SEQ);
                    
                else
                    receive_state_change(p_cli, NRF_CLI_RECEIVE_DEFAULT);
                    
                break;
                
