hananddong/ble_uwb_code/UWB_BLE_nrf52832/components/libraries/cli/nrf_cli.c
/* Function required by qsort. */
static int string_cmp(void const *pp_a, void const *pp_b)
{
    ASSERT(pp_a);
    ASSERT(pp_b);
    
    char const **pp_str_a = (char const **)pp_a;
    char const **pp_str_b = (char const **)pp_b;
    
    return strcmp(*pp_str_a, *pp_str_b);
}

static void cli_transport_evt_handler(nrf_cli_transport_evt_t evt_type, void *p_context)
{
    nrf_cli_t *p_cli = (nrf_cli_t *)p_context;
    ASSERT(p_cli);
    #if NRF_MODULE_ENABLED(NRF_CLI_USES_TASK_MANAGER)
    task_events_set(p_cli->p_ctx->task_id, evt_type == NRF_CLI_TRANSPORT_EVT_RX_RDY ?
                    NRF_CLI_TRANSPORT_RX_RDY_TASK_EVT : NRF_CLI_TRANSPORT_TX_RDY_TASK_EVT);
    #else
                    
    if(evt_type == NRF_CLI_TRANSPORT_EVT_RX_RDY)
    {
                    
    }
    else
    {
        /* wr done evt */
        p_cli->p_ctx->internal.flag.tx_rdy = 1;
    }
                    
    #endif
}

static ret_code_t nrf_cli_instance_init(nrf_cli_t const *p_cli,
                                        void const       *p_config,
                                        bool              use_colors)
{
    ASSERT(p_cli);
    ASSERT(p_cli->p_ctx && p_cli->p_iface && p_cli->p_name);
    ASSERT((p_cli->newline_char == '\n') || (p_cli->newline_char == '\r'));
    
    #if defined(NRF_CLI_LOG_BACKEND) && NRF_CLI_LOG_BACKEND
    ((nrf_cli_log_backend_t *)p_cli->p_log_backend->p_ctx)->p_cli = p_cli;
    #endif
    ret_code_t ret = p_cli->p_iface->p_api->init(p_cli->p_iface,
                                                 p_config,
                                                 cli_transport_evt_handler,
                                                 (void *)p_cli);
                                                 
    if(ret != NRF_SUCCESS)
        return ret;
        
    #if NRF_MODULE_ENABLED(NRF_CLI_HISTORY)
    ASSERT(p_cli->p_cmd_hist_mempool);
    ret = nrf_memobj_pool_init(p_cli->p_cmd_hist_mempool);
    
    if(ret != NRF_SUCCESS)
        return ret;
        
    p_cli->p_ctx->p_cmd_list_head = NULL;
    p_cli->p_ctx->p_cmd_list_tail = NULL;
    #endif
    
    memset(p_cli->p_ctx, 0, sizeof(nrf_cli_ctx_t));
    p_cli->p_ctx->internal.flag.tx_rdy = 1;
    
    #if NRF_MODULE_ENABLED(NRF_CLI_VT100_COLORS)
    p_cli->p_ctx->internal.flag.use_colors = use_colors;
    #endif
    p_cli->p_ctx->internal.flag.echo = NRF_CLI_ECHO_STATUS;
    p_cli->p_ctx->state = NRF_CLI_STATE_INITIALIZED;
    p_cli->p_ctx->vt100_ctx.cons.terminal_wid = NRF_CLI_DEFAULT_TERMINAL_WIDTH;
    p_cli->p_ctx->vt100_ctx.cons.terminal_hei = NRF_CLI_DEFAULT_TERMINAL_HEIGHT;
    
    const char * * pp_sorted_cmds = (const char * *)CLI_SORTED_CMD_PTRS_START_ADDR_GET;
    
    for(size_t i = 0; i < CLI_DATA_SECTION_ITEM_COUNT; i++)
    {
        const nrf_cli_cmd_entry_t *cmd;
        cmd = CLI_DATA_SECTION_ITEM_GET(i);
        
        /* NULL syntax commands not allowed. */
        ASSERT(cmd);
        ASSERT(cmd->u.p_static->p_syntax);
        
        pp_sorted_cmds[i] = cmd->u.p_static->p_syntax;
    }
    
    if(CLI_DATA_SECTION_ITEM_COUNT > 0)
    {
        qsort(pp_sorted_cmds,
              CLI_DATA_SECTION_ITEM_COUNT,
              sizeof(char *),
              string_cmp);
    }
    
    return NRF_SUCCESS;
}

#if NRF_MODULE_ENABLED(NRF_CLI_USES_TASK_MANAGER)
static ret_code_t nrf_cli_instance_uninit(nrf_cli_t const *p_cli);
void console_task(void *p_context)
{
    nrf_cli_t *p_cli = (nrf_cli_t *)p_context;
    
    ret_code_t ret = nrf_cli_start(p_cli);
    APP_ERROR_CHECK(ret);
    
    while(1)
    {
        uint32_t evts = task_events_wait(NRF_CLI_TASK_EVTS);
        
        if(evts & NRF_CLI_KILL_TASK_EVT)
        {
            (void)nrf_cli_instance_uninit(p_cli);
            task_exit();
        }
        
        else
            nrf_cli_process(p_cli);
    }
}
#endif

ret_code_t nrf_cli_init(nrf_cli_t const   *p_cli,
                        void const        *p_config,
                        bool               use_colors,
                        bool               log_backend,
                        nrf_log_severity_t init_lvl)
{
    ASSERT(p_cli);
    
    ret_code_t err_code = nrf_cli_instance_init(p_cli, p_config, use_colors);
    
    #if NRF_CLI_LOG_BACKEND && NRF_MODULE_ENABLED(NRF_LOG)
    
    if((err_code == NRF_SUCCESS) && log_backend && NRF_CLI_LOG_BACKEND)
    {
        int32_t id = nrf_log_backend_add(p_cli->p_log_backend, init_lvl);
        
        if(id < 0)
            return NRF_ERROR_NO_MEM;
            
        nrf_log_backend_enable(p_cli->p_log_backend);
    }
    
    #endif
    return err_code;
}

ret_code_t nrf_cli_task_create(nrf_cli_t const *p_cli)
{
    #if NRF_MODULE_ENABLED(NRF_CLI_USES_TASK_MANAGER)
    p_cli->p_ctx->task_id = task_create(console_task, p_cli->p_name, (void *)p_cli);
    
    if(p_cli->p_ctx->task_id == TASK_ID_INVALID)
        return NRF_ERROR_NO_MEM;
        
    else
        return NRF_SUCCESS;
        
    #else
    return NRF_ERROR_NOT_SUPPORTED;
    #endif
}

static ret_code_t nrf_cli_instance_uninit(nrf_cli_t const *p_cli)
{
    ASSERT(p_cli);
    ASSERT(p_cli->p_ctx && p_cli->p_iface && p_cli->p_name);
    
    if(cli_flag_processing_is_set(p_cli))
        return NRF_ERROR_BUSY;
        
    #if NRF_CLI_LOG_BACKEND && NRF_MODULE_ENABLED(NRF_LOG)
        
    if(p_cli->p_log_backend != NULL)
    {
        nrf_log_backend_disable(p_cli->p_log_backend);
        nrf_log_backend_remove(p_cli->p_log_backend);
    }
    
    #endif
    
    ret_code_t ret = p_cli->p_iface->p_api->uninit(p_cli->p_iface);
    
    if(ret != NRF_SUCCESS)
        return ret;
        
    #if NRF_MODULE_ENABLED(NRF_CLI_HISTORY)
    history_list_free_memory(p_cli);
    #endif
    
    memset(p_cli->p_ctx, 0, sizeof(nrf_cli_ctx_t));
    p_cli->p_ctx->state = NRF_CLI_STATE_UNINITIALIZED;
    
    return NRF_SUCCESS;
}

ret_code_t nrf_cli_uninit(nrf_cli_t const *p_cli)
{
    #if NRF_MODULE_ENABLED(NRF_CLI_USES_TASK_MANAGER)

    if(cli_flag_processing_is_set(p_cli))
        return NRF_ERROR_BUSY;
        
