hananddong/ble_uwb_code/UWB_BLE_nrf52832/components/libraries/cli/nrf_cli.c
    task_events_set(p_cli->p_ctx->task_id, NRF_CLI_KILL_TASK_EVT);
    return NRF_SUCCESS;
    #else
    return nrf_cli_instance_uninit(p_cli);
    #endif
}

ret_code_t nrf_cli_start(nrf_cli_t const *p_cli)
{
    ASSERT(p_cli);
    ASSERT(p_cli->p_ctx && p_cli->p_iface && p_cli->p_name);
    
    if(p_cli->p_ctx->state != NRF_CLI_STATE_INITIALIZED)
        return NRF_ERROR_INVALID_STATE;
        
    #if NRF_MODULE_ENABLED(NRF_CLI_USES_TASK_MANAGER)
    void *p_context = (void *)((uint32_t)task_id_get());
    ((nrf_cli_log_backend_t *)p_cli->p_log_backend->p_ctx)->p_context = p_context;
    #endif
    
    ret_code_t err_code = p_cli->p_iface->p_api->enable(p_cli->p_iface, false);
    
    #if NRF_MODULE_ENABLED(NRF_CLI_USES_TASK_MANAGER)
    task_events_set(task_id_get(), NRF_CLI_TRANSPORT_RX_RDY_TASK_EVT);
    #endif
    
    if(err_code == NRF_SUCCESS)
    {
        #if NRF_CLI_VT100_COLORS_ENABLED
        vt100_color_set(p_cli, NRF_CLI_NORMAL);
        vt100_bgcolor_set(p_cli, NRF_CLI_VT100_COLOR_BLACK);
        #endif
        nrf_fprintf(p_cli->p_fprintf_ctx, "\r\n\n");
        cli_state_set(p_cli, NRF_CLI_STATE_ACTIVE);
    }
    
    return err_code;
}

ret_code_t nrf_cli_stop(nrf_cli_t const *p_cli)
{
    ASSERT(p_cli);
    ASSERT(p_cli->p_ctx && p_cli->p_iface && p_cli->p_name);
    
    if(p_cli->p_ctx->state == NRF_CLI_STATE_INITIALIZED ||
       p_cli->p_ctx->state == NRF_CLI_STATE_UNINITIALIZED)
        return NRF_ERROR_INVALID_STATE;
        
    cli_state_set(p_cli, NRF_CLI_STATE_INITIALIZED);
    return NRF_SUCCESS;
}

void nrf_cli_process(nrf_cli_t const *p_cli)
{
    ASSERT(p_cli);
    ASSERT(p_cli->p_ctx && p_cli->p_iface && p_cli->p_name);
    
    nrf_cli_internal_t internal;
    internal.value = 0;
    internal.flag.processing = 1;
    (void)nrf_atomic_u32_or((nrf_atomic_u32_t *)&p_cli->p_ctx->internal.value,
                            internal.value);
                            
    switch(p_cli->p_ctx->state)
    {
        case NRF_CLI_STATE_UNINITIALIZED:
        case NRF_CLI_STATE_INITIALIZED:
            /* Console initialized but not started. */
            break;
            
        case NRF_CLI_STATE_ACTIVE:
        {
            cli_state_collect(p_cli);
            bool log_processed = cli_log_entry_process(p_cli, false);
            
            if(log_processed)
            {
                nrf_cli_fprintf(p_cli, NRF_CLI_INFO, "%s", p_cli->p_name);
                
                if(cli_flag_echo_is_set(p_cli))
                {
                    nrf_cli_fprintf(p_cli, NRF_CLI_NORMAL, "%s", p_cli->p_ctx->cmd_buff);
                    cursor_position_synchronize(p_cli);
                }
            }
            
            break;
        }
        
        default:
            break;
    }
    
    transport_buffer_flush(p_cli);
    internal.value = (uint32_t)0xFFFFFFFF;
    internal.flag.processing = 0;
    (void)nrf_atomic_u32_and((nrf_atomic_u32_t *)&p_cli->p_ctx->internal.value,
                             internal.value);
}

/* Function shall be only used by the nrf_fprintf module. */
void nrf_cli_print_stream(void const *p_user_ctx, char const *p_data, size_t data_len)
{
    cli_write((nrf_cli_t const *)p_user_ctx,
              p_data,
              data_len,
              NULL);
}

void nrf_cli_fprintf(nrf_cli_t const       *p_cli,
                     nrf_cli_vt100_color_t  color,
                     char const            *p_fmt,
                     ...)
{
    ASSERT(p_fmt);
    ASSERT(p_cli);
    ASSERT(p_cli->p_ctx && p_cli->p_iface && p_cli->p_name);
    
    va_list args = {0};
    va_start(args, p_fmt);
    
    #if NRF_MODULE_ENABLED(NRF_CLI_VT100_COLORS)
    
    if((p_cli->p_ctx->internal.flag.use_colors) &&
       (color != p_cli->p_ctx->vt100_ctx.col.col))
    {
        nrf_cli_vt100_colors_t col;
        
        vt100_colors_store(p_cli, &col);
        vt100_color_set(p_cli, color);
        
        nrf_fprintf_fmt(p_cli->p_fprintf_ctx, p_fmt, &args);
        
        vt100_colors_restore(p_cli, &col);
    }
    
    else
    #endif // NRF_MODULE_ENABLED(NRF_CLI_VT100_COLORS)
    {
        nrf_fprintf_fmt(p_cli->p_fprintf_ctx, p_fmt, &args);
    }
    
    va_end(args);
}

/*  Function prints a string on terminal screen with requested margin.
    It takes care to not divide words.
     p_cli               Pointer to CLI instance.
     p_str               Pointer to string to be printed.
     terminal_offset     Requested left margin.
     offset_first_line   Add margin to the first printed line.
*/
static void format_offset_string_print(nrf_cli_t const *p_cli,
                                       char const       *p_str,
                                       size_t            terminal_offset,
                                       bool              offset_first_line)
{
    if(p_str == NULL)
        return;
        
    if(offset_first_line)
        cursor_right_move(p_cli, terminal_offset);
        
    size_t length;
    size_t offset = 0;
    
    /* Skipping whitespace. */
    while(isspace((int) * (p_str + offset)))
        ++offset;
        
    while(1)
    {
        size_t idx = 0;
        length = cli_strlen(p_str) - offset;
        
        if(length <= p_cli->p_ctx->vt100_ctx.cons.terminal_wid - terminal_offset)
        {
            for(idx = 0; idx < length; idx++)
            {
                if(*(p_str + offset + idx) == '\n')
                {
                    transport_buffer_flush(p_cli);
                    cli_write(p_cli, p_str + offset, idx, NULL);
                    offset += idx + 1;
                    cursor_next_line_move(p_cli);
                    cursor_right_move(p_cli, terminal_offset);
                    break;
                }
            }
            
            /* String will fit in one line. */
            nrf_fprintf(p_cli->p_fprintf_ctx, p_str + offset);
            break;
        }
        
        else
        {
            /*  String is longer than terminal line so text needs to divide in the way
                to not divide words. */
            length = p_cli->p_ctx->vt100_ctx.cons.terminal_wid - terminal_offset;
            
            while(1)
            {
                /* Determining line break. */
                if(isspace((int)(*(p_str + offset + idx))))
                {
                    length = idx;
                    
                    if(*(p_str + offset + idx) == '\n')
                        break;
                }
                
