hananddong/ble_uwb_code/UWB_BLE_nrf52832/components/libraries/cli/nrf_cli.c
                if((idx + terminal_offset) >= p_cli->p_ctx->vt100_ctx.cons.terminal_wid)
                {
                    /* End of line reached. */
                    break;
                }
                
                ++idx;
            }
            
            /* Writing one line, fprintf IO buffer must be flushed before calling cli_write. */
            transport_buffer_flush(p_cli);
            cli_write(p_cli, p_str + offset, length, NULL);
            offset += length;
            
            /* Calculating text offset to ensure that next line will not begin with a space. */
            while(isspace((int)(*(p_str + offset))))
                ++offset;
                
            cursor_next_line_move(p_cli);
            cursor_right_move(p_cli, terminal_offset);
        }
    }
    
    cursor_next_line_move(p_cli);
}

void nrf_cli_help_print(nrf_cli_t const                *p_cli,
                        nrf_cli_getopt_option_t const *p_opt,
                        size_t                          opt_len)
{
    ASSERT(p_cli);
    ASSERT(p_cli->p_ctx && p_cli->p_iface && p_cli->p_name);
    
    static uint8_t const tab_len = 2;
    static char const opt_sep[] = ", "; /* options separator */
    static char const help[] = "-h, --help";
    static char const cmd_sep[] = " - "; /* command separator */
    uint16_t field_width = 0;
    uint16_t longest_string = cli_strlen(help) - cli_strlen(opt_sep);
    
    /* Printing help string for command. */
    nrf_cli_fprintf(p_cli,
                    NRF_CLI_NORMAL,
                    "%s%s",
                    p_cli->p_ctx->p_current_stcmd->p_syntax,
                    cmd_sep);
                    
    field_width = cli_strlen(p_cli->p_ctx->p_current_stcmd->p_syntax) + cli_strlen(cmd_sep);
    format_offset_string_print(p_cli, p_cli->p_ctx->p_current_stcmd->p_help, field_width, false);
    
    nrf_cli_fprintf(p_cli, NRF_CLI_NORMAL, "Options:\r\n");
    
    /* Looking for the longest option string. */
    if((opt_len > 0) && (p_opt != NULL))
    {
        for(size_t i = 0; i < opt_len; ++i)
        {
            if(cli_strlen(p_opt[i].p_optname_short) + cli_strlen(p_opt[i].p_optname)
               > longest_string)
            {
                longest_string = cli_strlen(p_opt[i].p_optname_short)
                                 + cli_strlen(p_opt[i].p_optname);
            }
        }
    }
    
    longest_string += cli_strlen(opt_sep) + tab_len;
    
    nrf_cli_fprintf(p_cli,
                    NRF_CLI_NORMAL,
                    "  %-*s:",
                    longest_string,
                    help);
                    
    /* Print help string for options (only -h and --help). */
    field_width = longest_string + tab_len + 1; /* tab_len + 1 == "  " and ':' from: "  %-*s:" */
    format_offset_string_print(p_cli, "Show command help.", field_width, false);
    
    /* Formating and printing all available options (except -h, --help). */
    if(p_opt != NULL)
    {
        for(size_t i = 0; i < opt_len; ++i)
        {
            if((p_opt[i].p_optname_short != NULL) && (p_opt[i].p_optname != NULL))
            {
                nrf_cli_fprintf(p_cli,
                                NRF_CLI_NORMAL,
                                "  %s%s%s",
                                p_opt[i].p_optname_short,
                                opt_sep,
                                p_opt[i].p_optname);
                field_width = longest_string + tab_len;
                cursor_right_move(p_cli,
                                  field_width - (cli_strlen(p_opt[i].p_optname_short)
                                                 + cli_strlen(p_opt[i].p_optname)
                                                 + tab_len
                                                 + cli_strlen(opt_sep)));
                cli_putc(p_cli, ':');
                ++field_width;  /* incrementing because char ':' was already printed above */
            }
            
            else if(p_opt[i].p_optname_short != NULL)
            {
                nrf_cli_fprintf(p_cli,
                                NRF_CLI_NORMAL,
                                "  %-*s:",
                                longest_string,
                                p_opt[i].p_optname_short);
                /* tab_len + 1 == "  " and ':' from: "  %-*s:" */
                field_width = longest_string + tab_len + 1;
            }
            
            else if(p_opt[i].p_optname != NULL)
            {
                nrf_cli_fprintf(p_cli,
                                NRF_CLI_NORMAL,
                                "  %-*s:",
                                longest_string,
                                p_opt[i].p_optname);
                /* tab_len + 1 == "  " and ':' from: "  %-*s:" */
                field_width = longest_string + tab_len + 1;
            }
            
            else
            {
                /* Do nothing. */
            }
            
            if(p_opt[i].p_optname_help != NULL)
                format_offset_string_print(p_cli, p_opt[i].p_optname_help, field_width, false);
                
            else
                cursor_next_line_move(p_cli);
        }
    }
    
    /* Checking if there are any subcommands avilable. */
    if(p_cli->p_ctx->p_current_stcmd->p_subcmd == NULL)
        return;
        
    /* Printing formatted help of one level deeper subcommands. */
    nrf_cli_static_entry_t static_entry;
    nrf_cli_cmd_entry_t const *p_cmd = p_cli->p_ctx->p_current_stcmd->p_subcmd;
    nrf_cli_static_entry_t const *p_st_cmd = NULL;
    
    field_width = 0;
    longest_string = 0;
    
    size_t cmd_idx = 0;
    
    /* Searching for the longest subcommand to print. */
    while(1)
    {
        cmd_get(p_cmd, !NRF_CLI_CMD_ROOT_LVL, cmd_idx++, &p_st_cmd, &static_entry);
        
        if(p_st_cmd == NULL)
            break;
            
        if(cli_strlen(p_st_cmd->p_syntax) > longest_string)
            longest_string = cli_strlen(p_st_cmd->p_syntax);
    }
    
    /* Checking if there are dynamic subcommands. */
    if(cmd_idx == 1)
    {
        /* No dynamic subcommands available. */
        return;
    }
    
    nrf_cli_fprintf(p_cli, NRF_CLI_NORMAL, "Subcommands:\r\n");
    
    /* Printing subcommands and help string (if exists). */
    cmd_idx = 0;
    
    while(1)
    {
        cmd_get(p_cmd, !NRF_CLI_CMD_ROOT_LVL, cmd_idx++, &p_st_cmd, &static_entry);
        
        if(p_st_cmd == NULL)
            break;
            
        field_width = longest_string + tab_len;
        nrf_cli_fprintf(p_cli, NRF_CLI_NORMAL, "  %-*s:", field_width, p_st_cmd->p_syntax);
        field_width += tab_len + 1; /* tab_len + 1 == "  " and ':' from: "  %-*s:" */
        
        if(p_st_cmd->p_help != NULL)
            format_offset_string_print(p_cli, p_st_cmd->p_help, field_width, false);
            
        else
            cursor_next_line_move(p_cli);
    }
}

#if NRF_CLI_LOG_BACKEND && NRF_MODULE_ENABLED(NRF_LOG)

