hananddong/ble_uwb_code/UWB_BLE_nrf52832/components/libraries/cli/nrf_cli.c
#define NRF_CLI_LOG_MSG_OVERFLOW_MSK ((uint32_t)7)
static bool cli_log_entry_process(nrf_cli_t const *p_cli, bool skip)
{
    nrf_log_entry_t entry;
    
    #if NRF_MODULE_ENABLED(NRF_CLI_STATISTICS)
    bool print_msg = false;
    #endif
    
    if(nrf_queue_pop(((nrf_cli_log_backend_t *)p_cli->p_log_backend->p_ctx)->p_queue, &entry) !=
       NRF_SUCCESS)
        return false;
        
    if(skip)
    {
        nrf_memobj_put(entry);
        #if NRF_MODULE_ENABLED(NRF_CLI_STATISTICS)
        ++p_cli->p_ctx->statistics.log_lost_cnt;
        
        if((p_cli->p_ctx->statistics.log_lost_cnt & NRF_CLI_LOG_MSG_OVERFLOW_MSK) == 1)
        {
            /* Set flag to print a message after clearing the currently entered command. */
            print_msg = true;
        }
        
        else
        #endif
        {
            return true;
        }
    }
    
    {
        /* Erasing the currently displayed command and console name. */
        nrf_cli_multiline_cons_t const *p_cons = multiline_console_data_check(p_cli);
        
        if(p_cons->cur_y > NRF_CLI_INITIAL_CURS_POS)
            cursor_up_move(p_cli, p_cons->cur_y - NRF_CLI_INITIAL_CURS_POS);
            
        if(p_cons->cur_x > NRF_CLI_INITIAL_CURS_POS)
            cursor_left_move(p_cli, p_cons->cur_x - NRF_CLI_INITIAL_CURS_POS);
            
        cli_clear_eos(p_cli);
    }
    
    #if NRF_MODULE_ENABLED(NRF_CLI_STATISTICS)
    
    if(print_msg)
    {
        /* Print the requested string and exit function. */
        nrf_cli_fprintf(p_cli, NRF_CLI_ERROR, "Lost logs - increase log backend queue size.\r\n");
        
        return true;
    }
    
    #endif
    
    /* Printing logs from the queue. */
    do
    {
        nrf_log_header_t header;
        size_t           memobj_offset = 0;
        nrf_log_str_formatter_entry_params_t params;
        
        nrf_memobj_read(entry, &header, HEADER_SIZE * sizeof(uint32_t), memobj_offset);
        memobj_offset = HEADER_SIZE * sizeof(uint32_t);
        
        params.timestamp  = header.timestamp;
        params.module_id  = header.module_id;
        params.dropped    = header.dropped;
        params.use_colors = NRF_LOG_USES_COLORS; /* Color will be provided by the console application. */
        
        if(header.base.generic.type == HEADER_TYPE_STD)
        {
            char const *p_log_str = (char const *)((uint32_t)header.base.std.addr);
            params.severity  = (nrf_log_severity_t)header.base.std.severity;
            uint32_t nargs   = header.base.std.nargs;
            uint32_t args[6];
            
            nrf_memobj_read(entry, args, nargs * sizeof(uint32_t), memobj_offset);
            nrf_log_std_entry_process(p_log_str,
                                      args,
                                      nargs,
                                      &params,
                                      p_cli->p_fprintf_ctx);
        }
        
        else if(header.base.generic.type == HEADER_TYPE_HEXDUMP)
        {
            uint32_t data_len;
            uint8_t data_buf[8];
            uint32_t chunk_len;
            
            data_len        = header.base.hexdump.len;
            params.severity = (nrf_log_severity_t)header.base.hexdump.severity;
            
            do
            {
                chunk_len = sizeof(data_buf) > data_len ? data_len : sizeof(data_buf);
                nrf_memobj_read(entry, data_buf, chunk_len, memobj_offset);
                memobj_offset += chunk_len;
                data_len      -= chunk_len;
                nrf_log_hexdump_entry_process(data_buf, chunk_len, &params, p_cli->p_fprintf_ctx);
            } while(data_len > 0);
        }
        
        nrf_memobj_put(entry);
    } while(nrf_queue_pop(((nrf_cli_log_backend_t *)p_cli->p_log_backend->p_ctx)->p_queue, &entry)
    
            == NRF_SUCCESS);
            
    return true;
}

static void nrf_log_backend_cli_put(nrf_log_backend_t const *p_backend, nrf_log_entry_t *p_msg)
{
    nrf_cli_log_backend_t *p_backend_cli = (nrf_cli_log_backend_t *)p_backend->p_ctx;
    nrf_cli_t const *p_cli = p_backend_cli->p_cli;
    
    //If panic mode cannot be handled, stop handling new requests.
    if(p_cli->p_ctx->state != NRF_CLI_STATE_PANIC_MODE_INACTIVE)
    {
        bool panic_mode = (p_cli->p_ctx->state == NRF_CLI_STATE_PANIC_MODE_ACTIVE);
        //If there is no place for a new log entry, remove the oldest one.
        ret_code_t err_code = nrf_queue_push(p_backend_cli->p_queue, &p_msg);
        
        while(err_code != NRF_SUCCESS)
        {
            (void)cli_log_entry_process(p_cli, panic_mode ? false : true);
            
            err_code = nrf_queue_push(p_backend_cli->p_queue, &p_msg);
        }
        
        nrf_memobj_get(p_msg);
        
        if(panic_mode)
            (void)cli_log_entry_process(p_cli, false);
            
        #if NRF_MODULE_ENABLED(NRF_CLI_USES_TASK_MANAGER)
        else
        {
            task_events_set((task_id_t)((uint32_t)p_backend_cli->p_context & 0x000000FF),
                            NRF_CLI_LOG_PENDING_TASK_EVT);
        }
        
        #endif
    }
}

static void nrf_log_backend_cli_flush(nrf_log_backend_t const *p_backend)
{
    nrf_cli_log_backend_t *p_backend_cli = (nrf_cli_log_backend_t *)p_backend->p_ctx;
    nrf_cli_t const        *p_cli = p_backend_cli->p_cli;
    nrf_log_entry_t        *p_msg;
    
    if(nrf_queue_pop(p_backend_cli->p_queue, &p_msg) == NRF_SUCCESS)
        (void)cli_log_entry_process(p_cli, false);
        
    UNUSED_PARAMETER(p_backend);
}

static void nrf_log_backend_cli_panic_set(nrf_log_backend_t const *p_backend)
{
    nrf_cli_log_backend_t *p_backend_cli = (nrf_cli_log_backend_t *)p_backend->p_ctx;
    nrf_cli_t const *p_cli = p_backend_cli->p_cli;
    
    if(p_cli->p_iface->p_api->enable(p_cli->p_iface, true) == NRF_SUCCESS)
        p_cli->p_ctx->state = NRF_CLI_STATE_PANIC_MODE_ACTIVE;
        
    else
        p_cli->p_ctx->state = NRF_CLI_STATE_PANIC_MODE_INACTIVE;
}

const nrf_log_backend_api_t nrf_log_backend_cli_api =
{
    .put       = nrf_log_backend_cli_put,
    .flush     = nrf_log_backend_cli_flush,
    .panic_set = nrf_log_backend_cli_panic_set,
};
#else
static bool cli_log_entry_process(nrf_cli_t const *p_cli, bool skip)
{
    UNUSED_PARAMETER(p_cli);
    UNUSED_PARAMETER(skip);
    return false;
}
#endif // NRF_CLI_LOG_BACKEND

/* ============ built-in commands ============ */
#if NRF_MODULE_ENABLED(NRF_CLI_BUILD_IN_CMDS)

static bool nrf_cli_build_in_cmd_common_executed(nrf_cli_t const                *p_cli,
                                                 bool                            arg_cnt_nok,
                                                 nrf_cli_getopt_option_t const *p_opt,
                                                 size_t                          opt_len)
{
    if(nrf_cli_help_requested(p_cli))
    {
        nrf_cli_help_print(p_cli, p_opt, opt_len);
        return true;
    }
    
    if(arg_cnt_nok)
    {
        nrf_cli_fprintf(p_cli,
                        NRF_CLI_ERROR,
                        "%s: wrong parameter count\r\n",
                        p_cli->p_ctx->p_current_stcmd->p_syntax);
        return true;
    }
    
