hananddong/ble_uwb_code/UWB_BLE_nrf52832/components/libraries/cli/nrf_cli.c
    return false;
}

static void nrf_cli_cmd_clear(nrf_cli_t const *p_cli, size_t argc, char **argv)
{
    ASSERT(p_cli);
    ASSERT(p_cli->p_ctx && p_cli->p_iface && p_cli->p_name);
    UNUSED_PARAMETER(argv);
    
    if((argc == 2) && (nrf_cli_help_requested(p_cli)))
    {
        nrf_cli_help_print(p_cli, NULL, 0);
        return;
    }
    
    NRF_CLI_VT100_CMD(p_cli, NRF_CLI_VT100_CURSORHOME);
    NRF_CLI_VT100_CMD(p_cli, NRF_CLI_VT100_CLEARSCREEN);
}

static void nrf_cli_cmd_cli(nrf_cli_t const *p_cli, size_t argc, char **argv)
{
    ASSERT(p_cli);
    ASSERT(p_cli->p_ctx && p_cli->p_iface && p_cli->p_name);
    UNUSED_PARAMETER(argv);
    
    if((argc == 1) || ((argc == 2) && nrf_cli_help_requested(p_cli)))
    {
        nrf_cli_help_print(p_cli, NULL, 0);
        return;
    }
    
    nrf_cli_fprintf(p_cli, NRF_CLI_ERROR, NRF_CLI_MSG_SPECIFY_SUBCOMMAND);
}

#if NRF_MODULE_ENABLED(NRF_CLI_VT100_COLORS)
static void nrf_cli_cmd_colors_off(nrf_cli_t const *p_cli, size_t argc, char **argv)
{
    if(nrf_cli_build_in_cmd_common_executed(p_cli, (argc != 1), NULL, 0))
        return;
        
    p_cli->p_ctx->internal.flag.use_colors = 0;
}

static void nrf_cli_cmd_colors_on(nrf_cli_t const *p_cli, size_t argc, char **argv)
{
    if(nrf_cli_build_in_cmd_common_executed(p_cli, (argc != 1), NULL, 0))
        return;
        
    p_cli->p_ctx->internal.flag.use_colors = 1;
}

static void nrf_cli_cmd_colors(nrf_cli_t const *p_cli, size_t argc, char **argv)
{
    ASSERT(p_cli);
    ASSERT(p_cli->p_ctx && p_cli->p_iface && p_cli->p_name);
    
    if(argc == 1)
    {
        nrf_cli_help_print(p_cli, NULL, 0);
        return;
    }
    
    if(nrf_cli_build_in_cmd_common_executed(p_cli, (argc != 2), NULL, 0))
        return;
        
    nrf_cli_fprintf(p_cli,
                    NRF_CLI_ERROR,
                    "%s:%s%s\r\n",
                    argv[0],
                    NRF_CLI_MSG_UNKNOWN_PARAMETER,
                    argv[1]);
}
#endif // NRF_MODULE_ENABLED(NRF_CLI_VT100_COLORS)

static void nrf_cli_cmd_echo(nrf_cli_t const *p_cli, size_t argc, char **argv)
{
    if(nrf_cli_build_in_cmd_common_executed(p_cli, (argc > 2), NULL, 0))
        return;
        
    if(argc == 2)
    {
        nrf_cli_fprintf(p_cli,
                        NRF_CLI_ERROR,
                        "%s:%s%s\r\n",
                        argv[0],
                        NRF_CLI_MSG_UNKNOWN_PARAMETER,
                        argv[1]);
        return;
    }
    
    nrf_cli_fprintf(p_cli,
                    NRF_CLI_NORMAL,
                    "Echo status: %s\r\n",
                    cli_flag_echo_is_set(p_cli) ? "on" : "off");
}

static void nrf_cli_cmd_echo_off(nrf_cli_t const *p_cli, size_t argc, char **argv)
{
    if(nrf_cli_build_in_cmd_common_executed(p_cli, (argc != 1), NULL, 0))
        return;
        
    cli_flag_echo_clear(p_cli);
}

static void nrf_cli_cmd_echo_on(nrf_cli_t const *p_cli, size_t argc, char **argv)
{
    if(nrf_cli_build_in_cmd_common_executed(p_cli, (argc != 1), NULL, 0))
        return;
        
    cli_flag_echo_set(p_cli);
}

#if NRF_MODULE_ENABLED(NRF_CLI_HISTORY)
static void nrf_cli_cmd_history(nrf_cli_t const *p_cli, size_t argc, char **argv)
{
    ASSERT(p_cli);
    ASSERT(p_cli->p_ctx && p_cli->p_iface && p_cli->p_name);
    
    if(nrf_cli_build_in_cmd_common_executed(p_cli, (argc != 1), NULL, 0))
        return;
        
    size_t i = 0;
    nrf_memobj_t const *p_cmd_list = p_cli->p_ctx->p_cmd_list_tail;
    nrf_cli_memobj_header_t header;
    
    while(1)
    {
        if((p_cmd_list == NULL) || (i >= NRF_CLI_HISTORY_ELEMENT_COUNT))
            break;
            
        nrf_memobj_read((nrf_memobj_t *)p_cmd_list,
                        &header,
                        NRF_CLI_HISTORY_HEADER_SIZE,
                        0);
        nrf_memobj_read((nrf_memobj_t *)p_cmd_list,
                        p_cli->p_ctx->temp_buff,
                        header.cmd_len + 1,
                        NRF_CLI_HISTORY_HEADER_SIZE);
        p_cmd_list = header.p_next;
        nrf_cli_fprintf(p_cli, NRF_CLI_NORMAL, "[%3d] %s\r\n", i++, p_cli->p_ctx->temp_buff);
    }
    
    p_cli->p_ctx->temp_buff[0] = '\0';
}
#endif // NRF_MODULE_ENABLED(NRF_CLI_HISTORY)

#if NRF_MODULE_ENABLED(NRF_CLI_STATISTICS)
void nrf_cli_cmd_cli_stats(nrf_cli_t const *p_cli, size_t argc, char **argv)
{
    if(argc == 1)
    {
        nrf_cli_help_print(p_cli, NULL, 0);
        return;
    }
    
    if(argc == 2)
    {
        nrf_cli_fprintf(p_cli,
                        NRF_CLI_ERROR,
                        "%s:%s%s\r\n",
                        argv[0],
                        NRF_CLI_MSG_UNKNOWN_PARAMETER,
                        argv[1]);
        return;
    }
    
    UNUSED_RETURN_VALUE(nrf_cli_build_in_cmd_common_executed(p_cli, (argc > 2), NULL, 0));
}

void nrf_cli_cmd_cli_stats_show(nrf_cli_t const *p_cli, size_t argc, char **argv)
{
    if(nrf_cli_build_in_cmd_common_executed(p_cli, (argc != 1), NULL, 0))
        return;
        
    nrf_queue_t const   *p_queue = ((nrf_cli_log_backend_t *)p_cli->p_log_backend->p_ctx)->p_queue;
    uint8_t max_util = nrf_queue_max_utilization_get(p_queue);
    uint8_t utilization = (uint8_t)(max_util * 100ul / p_queue->size);
    
    nrf_cli_fprintf(p_cli,
                    NRF_CLI_NORMAL,
                    "Lost logs: %u\r\n"
                    "Max log queue utilization: %u%% [%u/%u]\r\n",
                    p_cli->p_ctx->statistics.log_lost_cnt,
                    utilization,
                    max_util,
                    p_queue->size);
}

void nrf_cli_cmd_cli_stats_reset(nrf_cli_t const *p_cli, size_t argc, char **argv)
{
    if(nrf_cli_build_in_cmd_common_executed(p_cli, (argc != 1), NULL, 0))
        return;
        
    p_cli->p_ctx->statistics.log_lost_cnt = 0;
    nrf_queue_max_utilization_reset(
        ((nrf_cli_log_backend_t *)p_cli->p_log_backend->p_ctx)->p_queue);
}
#endif // NRF_MODULE_ENABLED(NRF_CLI_STATISTICS)

static void nrf_cli_cmd_resize_default(nrf_cli_t const *p_cli, size_t argc, char **argv)
{
    if(nrf_cli_build_in_cmd_common_executed(p_cli, (argc != 1), NULL, 0))
        return;
        
